<section class="about">
        <div>
                <h1 class="hidden">«Эксперт Ремонта» — ваш надежный партнер в ремонте вашей квартиры</h1>
                <p class="hidden">
                    <b>Без предоплаты и с полной прозрачностью.</b> Начните ремонт сейчас, оплатите после!
                </p>
                <p class="hidden">
                    ✓ <b>Специализация:</b> Работаем с новостройками и вторичным жильем, придавая каждому объекту идеальный вид. 
                </p>
                <p class="hidden">
                    ✓ <b>Постоянное совершенствование:</b> Регулярное улучшение технологий и методик работы гарантирует отменное качество. 
                </p>
                <p class="hidden">
                    ✓ <b>Контроль и гарантия:</b> Отслеживаем каждый этап выполнения работы и предоставляем гарантийное обслуживание в течение года. 
                </p>
                <p class="hidden">
                    ✓ <b>Выгодные условия закупки:</b> Получите максимальные скидки на стройматериалы у наших партнеров. 
                </p>
                <p class="hidden">
                    ✓ <b>Сервисное обслуживание:</b> Предлагаем комплексное и оперативное обслуживание для бизнеса: торговые точки, офисные центры, коттеджи и многое другое.
                </p>
                <p class="hidden" style="margin-top: 20px; border-top: 1px solid rgba(0,0,0,.25); padding: 10px 0">
                    Одним звонком решаем любой вопрос: В случае необходимости, наши мастера прибудут к вам в  течении от 4 до 12 часов и помогут во всех ваших начинаниях.
                </p>
                <p class="hidden" style="margin-top: 20px; border-top: 1px solid rgba(0,0,0,.25); padding: 10px 0">
                    Не откладывайте на потом! Обращайтесь к профессионалам из «Эксперт Ремонта» и получите лучший сервис, по лучшим ценам в городе, прямо сейчас
                </p>
        </div>
</section>