<?php

use Illuminate\Database\Migrations\Migration;
use Illuminate\Database\Schema\Blueprint;
use Illuminate\Support\Facades\Schema;

use App\Models\question;
use App\Models\service;
use App\Models\Review;
use App\Models\price;
use App\Models\category;
use App\Models\Contact;
use App\Models\Header;
use App\Models\WelcomeCard;
use App\Models\About;
use App\Models\WhyCard;
use App\Models\Sale;
use App\Models\CategoryImage;


return new class extends Migration
{
    /**
     * Run the migrations.
     */
    public function up(): void
    {
        //faq
        $buffers=
            [
                [
                    'question_ru'=>'Как производится оплата ремонта квартиры?',
                    'answer_ru'=>'Варианты расчетов:<br>- Без предоплаты с подписанием промежуточных актов.<br>- С предоплатой на материал если клиентом возложена на компанию данная функция, символическая сумма пополняется на счет клиента в компании а приобретаемые товары предоставляются клиенту в виде отчета.'
                ],
                [
                    'question_ru'=>'Сколько стоит ремонт квартиры?',
                    'answer_ru'=>'Для уточнения стоимости ремонта необходимо записаться на замер и получить консультацию у Вас непосредственно на объекте время замера и консультации среднем занимает 15 минут. Цена ремонта квартиры рассчитывается подробнейшим образом до "Гвоздя" и в среднем смета на ремонт квартиры занимает 3-7 листов формата А4. Хотите узнать много нового о вашем будущем качественном ремонте запишитесь на консультацию и замер.'
                ],
                [
                    'question_ru'=>'Срок выполнения работ?',
                    'answer_ru'=>'Так как компания работает без предоплаты и за простои не платят, на объекте отсутствуют простои полностью, а срок выполнения работ для заказчика оптимален. Простои могут быть допущены исключительно для создания технологических условий для разных групп применяемых материалов.<br>Более подробно за данным вопросом вы можете записаться на замер по телефону компании.'
                ],
                [
                    'question_ru'=>'Что такое гарантийное обслуживание?',
                    'answer_ru'=>'После выполнения всех работ и получения окончательного расчета компания выполняет обслуживание всех выполненных работ у клиента, как правило это касается проведенных коммуникаций электроснабжения и водоснабжения но и другие детали ремонта попадают под гарантию и обслуживание в случае если работы выполнялись под ключ с согласованной закупкой материалов с инженером компании. Заскрипели полы и двери, отошли обои, забились фильтры грубой очистки и т.д, мы все поправим достаточно позвонить специалист выедет незамедлительно или в удобное для вас время. Все работы по устранению недостатков компания выполняет за свой счет.'
                ],
                [
                    'question_ru'=>'Как оставить заявку',
                    'answer_ru'=>'В вашем распоряжении любое средство связи: интернет, телефон или личная встреча в офисе компании. Заявка не относится к договору или каким-либо другим обязательствам. Она всего лишь уведомит работников о Вашем желании вызвать бесплатного замерщика для консультации.'
                ],
                [
                    'question_ru'=>'Когда осуществляется замер и для чего он нужен?',
                    'answer_ru'=>'Замер производится в день подачи заявки, либо в другое удобное для Вас время, даже вечером. Его выполнит работник компании, он ответит на все Ваши вопросы, сориентирует в стоимости и подскажет наиболее удачные решения именно для Вашего ремонта. Предварительный замер необходим для составления сметы, он ни к чему Вас не обязывает.'
                ],
                [
                    'question_ru'=>'Что такое смета и для чего она нужна',
                    'answer_ru'=>'Смета составляется на основе замера и полностью готова в этот же день. Она наглядно покажет Вам – какие материалы потребуются, для чего они нужны, каков их расход и стоимость. Смета составляется единожды и остаётся неизменной на протяжении всего ремонта. После её утверждения вы можете ознакомиться с договором на выполнение работ.'
                ],
                [
                    'question_ru'=>'Какой заключается договор и какие он дает гарантии?',
                    'answer_ru'=>'Договор выполнения ремонтных работ является услугой подряда. Он юридически весом и служит Вашим абсолютным гарантом выполнения обязательств со стороны фирмы-исполнителя. Договор содержит в себе сроки, суммы и перечень обязанностей участников – всё по стандартам. После заключения договора производится предоплата, она также обусловлена договором.'
                ],
                [
                    'question_ru'=>'Как закупаются строительные материалы?',
                    'answer_ru'=>'Список материалов, составленный сотрудником, отправляется в магазины города. Это позволяет выбрать лучший вариант покупки по соотношению “Цена-Качество”. Когда настанет момент для покупки элементов стиля и декора, специалист компании проводит Вас в магазин и проконсультирует о надежности и пригодности, показав качественные материалы, либо мы приобретем строительные материалы сами предоставив вам подробный отчет. Каждый клиент компании получает ОПТОВЫЕ СКИДКИ на все приобретенные материалы.'
                ],
                [
                    'question_ru'=>'Кто будет заниматься ремонтом и когда?',
                    'answer_ru'=>'Выполнение ремонтных работ начинается незамедлительно – сразу после покупки всех необходимых материалов. Ваш ремонт выполнят трезвые, казахскоговорящие и русскоговорящие мастера имеющие большой опыт работы. Фирма выборочно сформирует бригаду узкой специализации, чьи навыки пригодятся именно для Вашего объекта. Все мастера работают уже давно и приучены выполнять работу ответственно, качественно и чисто.'
                ],
                [
                    'question_ru'=>'Как происходит сдача объекта?',
                    'answer_ru'=>'После выполнения всего спектра работ, прописанных в договоре, мастера делают уборку и полностью подготавливают объект к сдаче. В конце работы Вам предоставляется ещё одна полная отчетность в документальном виде. Только после того, как вы утвердите приём объекта, вносится окончательная оплата'
                ],
                [
                    'question_ru'=>'Как производится окончательный расчет и какова его сумма?',
                    'answer_ru'=>'Сумма, которая вноситься окончательным платежом обусловлена договором. Расчёт происходит только после Вашего подробного осмотра. Выплата денежных средств производится по окончанию всех работ, выплачивается только если Ваши требования выполнены в полной мере и замечаний к сотрудникам не имеется.'
                ],
            ];
        foreach ($buffers as $buffer)
        {
            question::create($buffer);
        }
        //service
        $buffers=
            [
                [
                    'title_ru'=>'Ремонт квартир',
                    'url'=>'remont-kvartir',
                    'description_ru'=>'test',
                    'src'=>'remont_kvartir_kategoriya-400x400.jpg',
                ],
                [
                    'title_ru'=>'Натяжные потолки',
                    'url'=>'natyazhnye-potolki',
                    'description_ru'=>'test',
                    'src'=>'natyazhnye_potolki_kategoriya-400x400.jpg',
                ],
                [
                    'title_ru'=>'Сантехника',
                    'url'=>'santehnika',
                    'description_ru'=>'test',
                    'src'=>'santehnika_kategoriya-400x400.jpg',
                ],
                [
                    'title_ru'=>'Электрика',
                    'url'=>'elektrika',
                    'description_ru'=>'test',
                    'src'=>'elektrika_kategoriya-400x400.jpg',
                ],
                [
                    'title_ru'=>'Корпусная мебель',
                    'url'=>'korpusnaya-mebel',
                    'description_ru'=>'test',
                    'src'=>'korpusnaya_mebel_kategoriya-400x400.jpg',
                ],
                [
                    'title_ru'=>'Дизайн интерьера',
                    'url'=>'dizajn-interera',
                    'description_ru'=>'test',
                    'src'=>'Dizajn_kategoriya-400x400.jpg',
                ]
            ];
        foreach ($buffers as $buffer)
        {
            service::create($buffer);
        }
        $buffers=
            [
                [

                    'username_ru'=>'Екатерина Лукашенко',
                    'rating'=>5,
                    'text_ru'=>'Хотела заказать встроенный шкаф купе с детской комнатой все на заказ в фирме *******  так как она самая разрекламированная и популярная в Астане и ценник тоже соответствовал ее статусу просто космос как я узнала позднее. Подруга убедила обратиться в данную компанию эксперт ремонта сказав отнеси дизайн пусть посчитают мы там заказывали кухню и ситуация была подобная сделали на уровне и придраться не к чему.  Цена в данной компании оказалась более чем щадящей без кредитов и рассрочек смогли позволить.  Благодарю за исполнение компанию в особенности Андрея что позволил отложить оплату до снятия вклада и Елену за доработку деталей. Заказом довольны полностью.'
                ],
                [
                'username_ru'=>'Татьяна',
                'rating'=>5,
                'text_ru'=>'Замечательная компания, отличные работники! Особая благодарность Александру, который все наши предложения грамотно воплотил в жизнь, постоянно отчитывался о работе. Объем с нуля под ключ быстро и качественно. Особенность компании - отношение с клиентом идеальное, без перекладывания на него проблем, а их решение. Спасибо, Вы лучшие!'
                ],
                [
                    'username_ru'=>'Смирнова Д.С',
                    'rating'=>5,
                    'text_ru'=>'Считала ремонт квартиры на сайте в калькуляторе неожиданно позвонили после этого и предложили рассчитать детально, создать проект кухни, электрики, планировки и освещения если стоимость не устроит сказав - то выполним в рассрочку. Угодили полностью качество высокое, предложения Александра и Толгата о деталях в интерьере с дизайном мебели и расстановке выше всех ожиданий, в том виде как обслуживают клиентов еще не встречала компаний с ними возможно многое'
                ],
                [
                    'username_ru'=>'Елена и Ирина Семёновы',
                    'rating'=>5,
                    'text_ru'=>'От чистого сердца хотим выразить благодарность компании "Эксперт ремонта"! Пожалуй, каждый из Вас кто сейчас читает отзыв, думает о том, в какую же компанию им обратиться, так вот…вне всяких раздумий и сомнений можете доверить свой ремонт ребятам именно из этой компании! Мы с дочерью заказывали ремонт ванной комнаты и туалета, из плюсов можем отметить, что все ремонтные работы были выполнены на совесть, а ремонт закончен даже раньше указанного в договоре срока. По завершению ремонта понимаем, что соотношение цены и качества полностью себя оправдало. Результат превзошёл все наши ожидания, до сих пор не можем поверить, что задуманная идея ремонта осуществилась. Также отдельно хотим выразить свою благодарность Александру за индивидуальный подход и внимание к нам как клиентам, ответственность, порядочность и оперативное решение вопросов, а также мастеру Александру – у Вас просто золотые руки! Однозначно будем обращаться ещё!'
                ],
                [
                    'username_ru'=>'Анна Васильевна',
                    'rating'=>5,
                    'text_ru'=>'В ноябре вызвала несколько замерщиков разных фирм попросила оценить ремонт в новостройке в новой 2ке, скажу точно что замерщик приезжая от других фирм ведет себя как то не естественно, приторно сладко, фальшиво, через чур интеллигентно сразу видно наиграно пока разговор идет в нужном им русле а чуть что не по ихнему сразу запинается и виляет и несет околесицу. В компании "Эксперт ремонта" приехал Толгат и Александр около часа затратили на замер и от некоторых решений пришлось отказаться по причине того что было Александром отказано выполнять из тех материалов о которых я говорила, но были предложены аналоги и дешевле. В итоге выполнили ремонт квартиры как и обещали до нового года, качество на высоте и было достигнуто максимальное взаимопонимание. В заключение: очень опытные, уверенные в своих силах и возможностях, очень настоящие и искрение, они всегда знают что делают и всегда правы, проникаешься и от ремонта получаешь удовольствие.'
                ],
                [
                    'username_ru'=>'анна',
                    'rating'=>5,
                    'text_ru'=>'Заказывали ремонт ванной комнаты ребята молодцы, выполняют ремонт не только качественно но и очень внимательны и отзывчивы к требованиям клиента. Во время доставки поцарапали ванну, наложили на погрузке туда других материалов. Так вот ребята сначала пол часа ругались за меня с водителем доставки а потом выехал Александр в магазин и решил вопрос о том чтобы бесплатно привезли новую ванну и подняли на этаж. Спасибо огромное я вам очень благодарна.'
                ],
                [
                    'username_ru'=>'Марианна',
                    'rating'=>5,
                    'text_ru'=>'Выполнен ремонт таунхауса на Черниговской набережной. Эта та компания которая делает ремонты и организовывает на объекте работы и процессы очень хорошо и профессионально. Очень довольны желаем успехов'
                ],
                [
                    'username_ru'=>'Елена П',
                    'rating'=>5,
                    'text_ru'=>'Пишу свой отзыв для тех, кто решил сделать хороший ремонт и обратился в компанию «Эксперт ремонта». Я точно могу посоветовать заказать ремонт кухни именно у этой компании. Своей кухней не налюбуюсь до сих пор! Задумка была моя. А так как нет у меня особых навыков, то директор Александр подсказал, как технически правильно будет выполнить задуманное и мы внесли небольшие изменения. В итоге – семи метровая кухня кажется теперь просто огромной! Мастер Ильяс смог посудомоечную машину установить и подключить всю сантехнику, а также провести вентиляционный короб без проблем! Хочется сказать что мастера, а это Евгений и Александр, которые с нами работали профессионалы своего дела. Прошло 6 месяцев, а ничего не отвалилось и не перекосилось. Ребята, спасибо Вам большое! Кстати, на время ремонтных работ вся семья оставалась дома, но присутствие рабочих нам не принесло никаких неудобств. Они работали слаженно и никому не мешали. По соотношению цена/качество очень даже приемлемо. Как договорились сделать, так и сделали. Была оказана помощь с выбором и доставкой стройматериалов. Необходимо отметить заинтересованность в результате директора компании Александра, его умение работать с заказчиками, а также «прозрачность» в решении финансовых вопросов. В дальнейшем, если ремонт, то только с компанией Эксперт Ремонта»! Всем рекомендую воспользоваться услугами, предлагаемыми этой компанией. Александр, Вам и вашим работникам большое спасибо.'
                ],
                [
                    'username_ru'=>'Светлана Ленина',
                    'rating'=>5,
                    'text_ru'=>'Спасибо все пришлось по вкусу  все работы в квартире профессионально без проблем закончены. Заслужили спасибо/качество очень даже приемлемо. Как договорились сделать, так и сделали. Была оказана помощь с выбором и доставкой стройматериалов. Необходимо отметить заинтересованность в результате директора компании Александра, его умение работать с заказчиками, а также «прозрачность» в решении финансовых вопросов. В дальнейшем, если ремонт, то только с компанией Эксперт Ремонта»! Всем рекомендую воспользоваться услугами, предлагаемыми этой компанией. Александр, Вам и вашим работникам большое спасибо.'
                ],
                [
                    'username_ru'=>'Николай и Людмила',
                    'rating'=>5,
                    'text_ru'=>'Благодарим Александра за урегулирование проблем с соседями по замене общих стояков. Просто суперский ход был применен всем ко всем жильцам! Спасибо все нравиться все на отлично рекомендуем.'
                ],
                [
                    'username_ru'=>'Мария',
                    'rating'=>5,
                    'text_ru'=>'Спасибо все в ремонте устроило все понравилось всем довольны. Хорошие ребята'
                ],
                [
                    'username_ru'=>'Анастасия и Марина Михайловна',
                    'rating'=>5,
                    'text_ru'=>'Здравствуйте хочу рассказать как сделали ремонт в новой квартире. При заказе обращались уже в множество других фирм но там считали как то все грубо дорого площадью пола халтура полная. Компания учла все пожелания рассчитала детально, получилось цена более приемлемой так что еще и на мебель осталось. Спасибо Александру что учел текущее положение семьи, Евгению и Сергею спасибо за кропотливую работу. Все классно все очень качественно! Спасибо желаем успехов и процветания'
                ],
                [
                    'username_ru'=>'Валентина Махова',
                    'rating'=>5,
                    'text_ru'=>'Инженеру Дмитрию личная благодарность, помог выбрать материалы для ремонта был очень терпелив. Прошёл ремонт квартиры незабываемо все супер. Рекомендую тем кто для себя для жизни.'
                ],
                [
                    'username_ru'=>'Елена',
                    'rating'=>5,
                    'text_ru'=>'Заказала шкаф купе ждала очередь 30 дней сделали и все понравилось. Цена устроила даже привлекла и не пожалела . Спасибо'
                ],
                [
                    'username_ru'=>'Дмитрий Караваево',
                    'rating'=>5,
                    'text_ru'=>'Спасибо все в ремонте устроило все понравилось всем довольны. Рекомендую'
                ],
                [
                    'username_ru'=>'Евгения и Стас',
                    'rating'=>4,
                    'text_ru'=>'Спасибо большое за сборку дома из бруса , Быстро без заминок, все рассказали как будет стоять и как эксплуатировать. Обещали сделать под крышу за две недели получилось за три. Материал рассчитан был без остатков все отлично, брус не гнилой не синий шлифуй крась и живи. Благодарим вашу компанию и Александра инженера'
                ],
                [
                    'username_ru'=>'Евгения и Стас',
                    'rating'=>5,
                    'text_ru'=>'В том году заказали изготовить недорогой фундамент для дома из бруса сделали ленточный не глубокий, завтра продолжаем строительство ставим весь дом обещали и в договоре написали за 14 дней. Проверим'
                ],
                [
                    'username_ru'=>'Евгения Смирнова',
                    'rating'=>5,
                    'text_ru'=>'Здравствуйте ремонт прошел на ура! Все очень мило и красиво получилось благодаря советам Александра . Мастера симпатичные, общительные, женатые. Спасибо я очень признательна вам за оказанную мне поддержку во время ремонта .'
                ],
                [
                    'username_ru'=>'Смиренова Анастасия',
                    'rating'=>5,
                    'text_ru'=>'Спасибо компании за ремонт новой квартиры, за понимание неимения возможности оплатить дорогой ремонт в ситуации взятой квартиры в ипотеку. Все славненько ) доступно , надежно . Отдельное Спасибо за скидки в магазинах и понимание Толгата и Александра.'
                ],
                [
                    'username_ru'=>'Ирина',
                    'rating'=>5,
                    'text_ru'=>'Решила сделать ремонт в квартире, зашла на сайты нескольких фирм. Выбрала компанию "Эксперт ремонта" и не жалею. Ремонт выполнен очень качественно и в срок. Сотрудники компании очень порядочные и ответственные люди, все делают с душой. Спасибо руководителю компании Александру и мастерам Асмету и Айтугану.'
                ],
                [
                    'username_ru'=>'Тамара Петровна',
                    'rating'=>5,
                    'text_ru'=>'Здравствуйте уважаемая компания обращаемся ко всем сотрудникам кто работал строя наш дом в пос Селище Астанского района, Благодарим Вас от всего сердца и желаем здоровья вам и вашим родным и близким. Семья Харитоновых'
                ],
                [
                    'username_ru'=>'Ирина',
                    'rating'=>4,
                    'text_ru'=>'Спасибо огромное за ремонт на улице Шагова , отметим исполнительность и пунктуальность сотрудников.'
                ],
                [
                    'username_ru'=>'Наталья',
                    'rating'=>5,
                    'text_ru'=>'Мне нужно было сдать квартиру и требовался ремонт в гостиной. Обратилась в компанию «Эксперт ремонта», обозначила, что дело срочное и дешевое. Сделали за неделю! Такие молодцы! Жильцы живут уже целый год, не одной жалобы на состояние квартиры нет! Огромное спасибо за понимание! обратилась ещё)'
                ],
                [
                    'username_ru'=>'Жанна',
                    'rating'=>5,
                    'text_ru'=>'Заказала комплексный ремонт ванной, в фирму обратилась первый раз в жизни. Живем с мужем на первом этаже, эта вечная сырость и грибок очень надоели и омрачили жизнь. Прошло уже полгода с окончания ремонтных работ, а все поверхности до сих пор как новые и сантехника функционирует класс. Довольны не только итогом, но и оперативностью бригады! Ни опоздали и сдали в срок!'
                ],
                [
                    'username_ru'=>'Антон и Катя',
                    'rating'=>5,
                    'text_ru'=>'5 лет не могли решиться на ремонт в прихожей муж всегда откладывал. Знакомые посоветовали мастеров из фирмы Эксперт ремонта, мол сделают все быстро и на раз . После звонка замерщик был у нас дома уже через 1.5 часа! А к работе приступили на следующий день! Мы были довольны результатом и через два месяца обратились ещё раз по балкону'
                ]
            ];
        foreach ($buffers as $buffer)
        {
            Review::create($buffer);
        }
        $buffers=
            [
                [
                    'title_ru'=>'Монтаж металлической двери (стандартный проем)',
                    'unit_ru'=>'шт.',
                    'price'=>'8380',
                    'category'=>'Установка дверей'
                ],
                [
                    'title_ru'=>'Монтаж дверного блока без фурнитуры',
                    'unit_ru'=>'шт.',
                    'price'=>'3919',
                    'category'=>'Установка дверей'
                ],
                [
                    'title_ru'=>'Установка порога',
                    'unit_ru'=>'шт.',
                    'price'=>'855',
                    'category'=>'Установка дверей'
                ],
                [
                    'title_ru'=>'Устройство дверного откоса из ГКЛ',
                    'unit_ru'=>'п. м.',
                    'price'=>'2892',
                    'category'=>'Установка дверей'
                ],
                [
                    'title_ru'=>'Устройство откоса арок из ГКЛ угол 90гр',
                    'unit_ru'=>'п. м.',
                    'price'=>'1520',
                    'category'=>'Установка дверей'
                ],
                [
                    'title_ru'=>'Устройство откоса арок из ГКЛ овал',
                    'unit_ru'=>'п. м.',
                    'price'=>'2290',
                    'category'=>'Установка дверей'
                ],

                [
                    'title_ru'=>'Простая штукатурка стен',
                    'unit_ru'=>'кв. м.',
                    'price'=>'1061',
                    'category'=>'Отделочные работы'
                ],
                [
                    'title_ru'=>'Улучшенная штукатурка стен',
                    'unit_ru'=>'кв. м.',
                    'price'=>'1209',
                    'category'=>'Отделочные работы'
                ],
                [
                    'title_ru'=>'Высококачественная штукатурка стен',
                    'unit_ru'=>'кв. м.',
                    'price'=>'1736',
                    'category'=>'Отделочные работы'
                ],
                [
                    'title_ru'=>'Укладка керамической плиткой',
                    'unit_ru'=>'кв. м.',
                    'price'=>'3102',
                    'category'=>'Отделочные работы'
                ],
                [
                    'title_ru'=>'Укладка поверхности натуральным камнем',
                    'unit_ru'=>'кв. м.',
                    'price'=>'2680',
                    'category'=>'Отделочные работы'
                ],
                [
                    'title_ru'=>'Затирка швов кафельной плитки',
                    'unit_ru'=>'кв. м.',
                    'price'=>'337',
                    'category'=>'Отделочные работы'
                ],
                [
                    'title_ru'=>'Устройство бордюра керамической плитки',
                    'unit_ru'=>'п. м.',
                    'price'=>'450',
                    'category'=>'Отделочные работы'
                ],
                [
                    'title_ru'=>'Облицовка плиткой мозаикой',
                    'unit_ru'=>'кв. м.',
                    'price'=>'450',
                    'category'=>'Отделочные работы'
                ],
                [
                    'title_ru'=>'Поклейка обоев (бумажных)',
                    'unit_ru'=>'кв. м.',
                    'price'=>'554',
                    'category'=>'Отделочные работы'
                ],
                [
                    'title_ru'=>'Обои под покраску',
                    'unit_ru'=>'кв. м.',
                    'price'=>'642',
                    'category'=>'Отделочные работы'
                ],
                [
                    'title_ru'=>'Флизелиновых обоев',
                    'unit_ru'=>'кв. м.',
                    'price'=>'709',
                    'category'=>'Отделочные работы'
                ],
                [
                    'title_ru'=>'Нанесение жидких обоев',
                    'unit_ru'=>'кв. м.',
                    'price'=>'1750',
                    'category'=>'Отделочные работы'
                ],
                [
                    'title_ru'=>'Устройство стен из ГКЛ (1 сторона)',
                    'unit_ru'=>'кв. м.',
                    'price'=>'1344',
                    'category'=>'Отделочные работы'
                ],
                [
                    'title_ru'=>'Устройство перегородок из ГКЛ (2 сторона)',
                    'unit_ru'=>'кв. м.',
                    'price'=>'2568',
                    'category'=>'Отделочные работы'
                ],
                [
                    'title_ru'=>'Устройство перегородок из ГКЛ с звукоизоляцией',
                    'unit_ru'=>'кв. м.',
                    'price'=>'3358',
                    'category'=>'Отделочные работы'
                ],
                [
                    'title_ru'=>'Окраска стен (1 слой)',
                    'unit_ru'=>'кв. м.',
                    'price'=>'270',
                    'category'=>'Отделочные работы'
                ],
                [
                    'title_ru'=>'Грунтовка стен (1 слой)',
                    'unit_ru'=>'кв. м.',
                    'price'=>'209',
                    'category'=>'Отделочные работы'
                ],
                [
                    'title_ru'=>'Шпаклевка стен под обои (1 слой)',
                    'unit_ru'=>'кв. м.',
                    'price'=>'337',
                    'category'=>'Отделочные работы'
                ],
                [
                    'title_ru'=>'Шпаклевка стен под окраску (1 слой)',
                    'unit_ru'=>'кв. м.',
                    'price'=>'574',
                    'category'=>'Отделочные работы'
                ],
                [
                    'title_ru'=>'Установка стеновых панелей',
                    'unit_ru'=>'кв. м.',
                    'price'=>'1986',
                    'category'=>'Отделочные работы'
                ],
                [
                    'title_ru'=>'Облицовка стен “Сайдингом” с мет. Каркасом',
                    'unit_ru'=>'кв. м.',
                    'price'=>'1851',
                    'category'=>'Отделочные работы'
                ],

                [
                    'title_ru'=>'Устройство стяжки из ПЦР толщина 30-150 мм',
                    'unit_ru'=>'кв. м.',
                    'price'=>'1851',
                    'category'=>'Работы по устройству полов'
                ],
                [
                    'title_ru'=>'Укладка керамической плитки',
                    'unit_ru'=>'кв. м.',
                    'price'=>'1959',
                    'category'=>'Работы по устройству полов'
                ],
                [
                    'title_ru'=>'Устройство пола из керамогранита',
                    'unit_ru'=>'кв. м.',
                    'price'=>'2568',
                    'category'=>'Работы по устройству полов'
                ],
                [
                    'title_ru'=>'Устройство пола из природного камня',
                    'unit_ru'=>'кв. м.',
                    'price'=>'3845',
                    'category'=>'Работы по устройству полов'
                ],
                [
                    'title_ru'=>'Устройство черновых полов из ДСП, влагостойкой фанера',
                    'unit_ru'=>'кв. м.',
                    'price'=>'1148',
                    'category'=>'Работы по устройству полов'
                ],
                [
                    'title_ru'=>'Настил штучного паркета',
                    'unit_ru'=>'кв. м.',
                    'price'=>'4663',
                    'category'=>'Работы по устройству полов'
                ],
                [
                    'title_ru'=>'Настил линолиума',
                    'unit_ru'=>'кв. м.',
                    'price'=>'473',
                    'category'=>'Работы по устройству полов'
                ],
                [
                    'title_ru'=>'Настил коврового покрытия',
                    'unit_ru'=>'кв. м.',
                    'price'=>'473',
                    'category'=>'Работы по устройству полов'
                ],
                [
                    'title_ru'=>'Настил ламината',
                    'unit_ru'=>'кв. м.',
                    'price'=>'1013',
                    'category'=>'Работы по устройству полов'
                ],
                [
                    'title_ru'=>'Покраска поверхности пола (1 слой)',
                    'unit_ru'=>'кв. м.',
                    'price'=>'1822',
                    'category'=>'Работы по устройству полов'
                ],
                [
                    'title_ru'=>'Штукатурка (слой до 2см)',
                    'unit_ru'=>'кв. м.',
                    'price'=>'1014',
                    'category'=>'Работы по устройству полов'
                ],
                [
                    'title_ru'=>'Шпаклевка под побелку, покраску (2 слоя)',
                    'unit_ru'=>'кв. м.',
                    'price'=>'1015',
                    'category'=>'Работы по устройству полов'
                ],

                [
                    'title_ru'=>'Устройство потолков из ГКЛ, ГВЛ',
                    'unit_ru'=>'кв. м.',
                    'price'=>'278',
                    'category'=>'Устройство потолков'
                ],
                [
                    'title_ru'=>'Наклейка обоев на потолок',
                    'unit_ru'=>'кв. м.',
                    'price'=>'85',
                    'category'=>'Устройство потолков'
                ],
                [
                    'title_ru'=>'Устройство потолков из пластиковых панелей',
                    'unit_ru'=>'кв. м.',
                    'price'=>'330',
                    'category'=>'Устройство потолков'
                ],
                [
                    'title_ru'=>'Устройство потолочного плинтуса (гипсовый багет)',
                    'unit_ru'=>'п. м.',
                    'price'=>'30',
                    'category'=>'Устройство потолков'
                ],
                [
                    'title_ru'=>'Устройство потолочного плинтуса (пластик)',
                    'unit_ru'=>'п. м.',
                    'price'=>'50',
                    'category'=>'Устройство потолков'
                ],

                [
                    'title_ru'=>'Укладка тротуарной плитки',
                    'unit_ru'=>'кв. м.',
                    'price'=>'1689',
                    'category'=>'Строительные работы'
                ],
                [
                    'title_ru'=>'Армирование фундамента',
                    'unit_ru'=>'тн',
                    'price'=>'33790',
                    'category'=>'Строительные работы'
                ],
                [
                    'title_ru'=>'Рытье траншеи под фундамент (вручную)',
                    'unit_ru'=>'куб. м.',
                    'price'=>'6082',
                    'category'=>'Строительные работы'
                ],
                [
                    'title_ru'=>'Установка опалубки',
                    'unit_ru'=>'кв. м.',
                    'price'=>'2365',
                    'category'=>'Строительные работы'
                ],
                [
                    'title_ru'=>'Бетонирование фундаментов',
                    'unit_ru'=>'куб. м.',
                    'price'=>'4392',
                    'category'=>'Строительные работы'
                ],
                [
                    'title_ru'=>'Монтаж фундаментных блоков',
                    'unit_ru'=>'куб. м.',
                    'price'=>'2703',
                    'category'=>'Строительные работы'
                ],
                [
                    'title_ru'=>'Кладка стен из кирпича (1 кирпич)',
                    'unit_ru'=>'куб. м.',
                    'price'=>'9461',
                    'category'=>'Строительные работы'
                ],
                [
                    'title_ru'=>'Кладка стен из кирпича (1,- 2 кирпича)',
                    'unit_ru'=>'куб. м.',
                    'price'=>'8785',
                    'category'=>'Строительные работы'
                ],
                [
                    'title_ru'=>'Кладка стен более чем 2 кирпича',
                    'unit_ru'=>'куб. м.',
                    'price'=>'8109',
                    'category'=>'Строительные работы'
                ],
                [
                    'title_ru'=>'Наружная облицовка стен кирпичом',
                    'unit_ru'=>'кв. м.',
                    'price'=>'5054',
                    'category'=>'Строительные работы'
                ],
                [
                    'title_ru'=>'Кладка стен из гипсоблоков',
                    'unit_ru'=>'куб. м.',
                    'price'=>'4074',
                    'category'=>'Строительные работы'
                ],
                [
                    'title_ru'=>'Кладка кирпичных перегородок',
                    'unit_ru'=>'кв. м.',
                    'price'=>'2560',
                    'category'=>'Строительные работы'
                ],
                [
                    'title_ru'=>'Монтаж плит перекрытия',
                    'unit_ru'=>'кв. м.',
                    'price'=>'4055',
                    'category'=>'Строительные работы'
                ],

                [
                    'title_ru'=>'Установка Унитаза “Компакт”',
                    'unit_ru'=>'шт.',
                    'price'=>'4054',
                    'category'=>'Сантехнические работы'
                ],
                [
                    'title_ru'=>'Установка Настенного унитаза',
                    'unit_ru'=>'шт.',
                    'price'=>'6400',
                    'category'=>'Сантехнические работы'
                ],
                [
                    'title_ru'=>'Установка биде',
                    'unit_ru'=>'шт.',
                    'price'=>'4730',
                    'category'=>'Сантехнические работы'
                ],
                [
                    'title_ru'=>'Установка писсуара',
                    'unit_ru'=>'шт.',
                    'price'=>'3379',
                    'category'=>'Сантехнические работы'
                ],
                [
                    'title_ru'=>'Раковины на пьедестале',
                    'unit_ru'=>'шт.',
                    'price'=>'4054',
                    'category'=>'Сантехнические работы'
                ],
                [
                    'title_ru'=>'Установка ванны',
                    'unit_ru'=>'шт.',
                    'price'=>'5406',
                    'category'=>'Сантехнические работы'
                ],
                [
                    'title_ru'=>'Установка водонагреватель накопительный',
                    'unit_ru'=>'шт.',
                    'price'=>'7433',
                    'category'=>'Сантехнические работы'
                ],
                [
                    'title_ru'=>'Установка радиаторы отопления',
                    'unit_ru'=>'шт.',
                    'price'=>'10137',
                    'category'=>'Сантехнические работы'
                ],
                [
                    'title_ru'=>'Установка полотенцесушителя',
                    'unit_ru'=>'шт.',
                    'price'=>'6800',
                    'category'=>'Сантехнические работы'
                ],
                [
                    'title_ru'=>'Установка Водосчетчика',
                    'unit_ru'=>'шт.',
                    'price'=>'4122',
                    'category'=>'Сантехнические работы'
                ],
                [
                    'title_ru'=>'Установка смесителя',
                    'unit_ru'=>'шт.',
                    'price'=>'3041',
                    'category'=>'Сантехнические работы'
                ],
                [
                    'title_ru'=>'Подключение стиральной машины',
                    'unit_ru'=>'шт.',
                    'price'=>'4730',
                    'category'=>'Сантехнические работы'
                ],
                [
                    'title_ru'=>'Подключение фильтров тонкой очистки',
                    'unit_ru'=>'шт.',
                    'price'=>'4054',
                    'category'=>'Сантехнические работы'
                ],

                [
                    'title_ru'=>'Монтаж шиферной кровли',
                    'unit_ru'=>'кв. м.',
                    'price'=>'2703',
                    'category'=>'Кровельные работы'
                ],
                [
                    'title_ru'=>'Монтаж кровли металлочерепицей',
                    'unit_ru'=>'кв. м.',
                    'price'=>'2027',
                    'category'=>'Кровельные работы'
                ],
                [
                    'title_ru'=>'Устройство кровли из рубероида (1 слой)',
                    'unit_ru'=>'кв. м.',
                    'price'=>'1015',
                    'category'=>'Кровельные работы'
                ],
                [
                    'title_ru'=>'Устройство кровли из бикроста (1 слой)',
                    'unit_ru'=>'кв. м.',
                    'price'=>'170',
                    'category'=>'Кровельные работы'
                ],
                [
                    'title_ru'=>'Утепление кровли мин. Плитой (1 слой)',
                    'unit_ru'=>'кв. м.',
                    'price'=>'500',
                    'category'=>'Кровельные работы'
                ],
                [
                    'title_ru'=>'Гидроизоляция кровли',
                    'unit_ru'=>'кв. м.',
                    'price'=>'506',
                    'category'=>'Кровельные работы'
                ],
                [
                    'title_ru'=>'Подшивка карнизов',
                    'unit_ru'=>'п. м.',
                    'price'=>'1689',
                    'category'=>'Кровельные работы'
                ],
                [
                    'title_ru'=>'Установка водосточных труб и сливов',
                    'unit_ru'=>'п. м.',
                    'price'=>'1486',
                    'category'=>'Кровельные работы'
                ],
                [
                    'title_ru'=>'Установка карнизов',
                    'unit_ru'=>'шт.',
                    'price'=>'3041',
                    'category'=>'Кровельные работы'
                ],
            ];
        foreach ($buffers as $buffer)
        {
            price::create($buffer);
        }
        $buffers=
            [
                [
                    'title_ru'=>'Шумоизоляция квартиры',
                    'url'=>'shumoizolyatsiya-kvartir',
                    'description_ru'=>'test',
                    'service_id'=>'1',
                    'src'=>'setwalls.ru-81752-400x400.jpg',
                ],
                [
                    'title_ru'=>'Ремонт под ключ',
                    'url'=>'remont-pod-klyuch',
                    'description_ru'=>'test',
                    'service_id'=>'1',
                    'src'=>'remont_kvartir_pod_klyuch-400x400.jpg',
                ],
                [
                    'title_ru'=>'Качественный ремонт как?',
                    'url'=>'kachestvennyj-remont-kak',
                    'description_ru'=>'test',
                    'service_id'=>'1',
                    'src'=>'3-5-400x400.jpg',
                ],
                [
                    'title_ru'=>'Капитальный ремонт',
                    'url'=>'kapitalnyj-remont',
                    'description_ru'=>'test',
                    'service_id'=>'1',
                    'src'=>'kapital-remont1-400x400.jpg',
                ],
                [
                    'title_ru'=>'Евроремонт в квартире клиентов',
                    'url'=>'evroremont-v-kvartire-klientov',
                    'description_ru'=>'test',
                    'service_id'=>'1',
                    'src'=>'1_16-400x400.jpg',
                ],
                [
                    'title_ru'=>'Косметический ремонт',
                    'url'=>'kosmeticheskij-remont-ch-1',
                    'description_ru'=>'test',
                    'service_id'=>'1',
                    'src'=>'kosmet-remont-kvartir-kit-bud1-400x400.jpg',
                ],
                [
                    'title_ru'=>'Ремонт полов',
                    'url'=>'remont-polov',
                    'description_ru'=>'test',
                    'service_id'=>'1',
                    'src'=>'pic-R10-400x400.jpg',
                ],
                [
                    'title_ru'=>'Отделочные работы',
                    'url'=>'otdelochnye-raboty',
                    'description_ru'=>'test',
                    'service_id'=>'1',
                    'src'=>'proizvodstvo-otdelochnye-raboty-2-400x400.jpg',
                ],
                [
                    'title_ru'=>'Ремонт ванной комнаты',
                    'url'=>'remont-vannoj-ch-1',
                    'description_ru'=>'test',
                    'service_id'=>'1',
                    'src'=>'52-400x400.jpg',
                ],
                [
                    'title_ru'=>'Утепление и отделка лоджий',
                    'url'=>'uteplenie-i-otdelka-lodzhij',
                    'description_ru'=>'test',
                    'service_id'=>'1',
                    'src'=>'13165002406884_1-400x400.jpg',
                ],
                [
                    'title_ru'=>'Укладка кафельной плитки',
                    'url'=>'ukladka-kafelnoj-plitki',
                    'description_ru'=>'test',
                    'service_id'=>'1',
                    'src'=>'ukladka-kafelnoj-plitki-v-vannoj-komnate-2-1024x768-400x400.jpg',
                ],
                [
                    'title_ru'=>'Пластиковая  вагонка в ванной',
                    'url'=>'plastikovaya-vagonka-v-vannoj',
                    'description_ru'=>'test',
                    'service_id'=>'1',
                    'src'=>'ustanovka-potolka-iz-plastikovyh-paneley-400x400.jpg',
                ],
                [
                    'title_ru'=>'Ремонт кухни',
                    'url'=>'remont-kuhni',
                    'description_ru'=>'test',
                    'service_id'=>'1',
                    'src'=>'kuhni-na-zakaz-400x400.jpg',
                ],
                [
                    'title_ru'=>'Установка дверей',
                    'url'=>'ustanovka-dverej-tsena',
                    'description_ru'=>'test',
                    'service_id'=>'1',
                    'src'=>'vrez-zamka.e1078f57b4a0a3eb7d4b5734a932e6d980-400x400.jpg',
                ],

                [
                    'title_ru'=>'Натяжной потолок',
                    'url'=>'natyazhnoj-potolok',
                    'description_ru'=>'test',
                    'service_id'=>'2',
                    'src'=>'k6-400x400.jpg',
                ],
                [
                    'title_ru'=>'Время натяжного потолка',
                    'url'=>'natyazhnyie-potolki',
                    'description_ru'=>'test',
                    'service_id'=>'2',
                    'src'=>'12m-3.5chasa-1024x768-400x400.jpg',
                ],
                [
                    'title_ru'=>'Натяжные тканевые потолки',
                    'url'=>'natyazhnye-tkanevye-potolki',
                    'description_ru'=>'test',
                    'service_id'=>'2',
                    'src'=>'Fabric14_0_1-400x400.jpg',
                ],
                [
                    'title_ru'=>'Пленочные натяжные потолки',
                    'url'=>'plenochnye-natyazhnye-potolki',
                    'description_ru'=>'test',
                    'service_id'=>'2',
                    'src'=>'potolok-400x400.jpg',
                ],
                [
                    'title_ru'=>'Двухуровневые натяжные потолки',
                    'url'=>'dvuhurovnevye-natyazhnye-potolki',
                    'description_ru'=>'test',
                    'service_id'=>'2',
                    'src'=>'15m-18chasor-400x400.jpg',
                ],
                [
                    'title_ru'=>'Натяжной потолок звездное небо',
                    'url'=>'natyazhnoj-potolok-zvezdnoe-nebo',
                    'description_ru'=>'test',
                    'service_id'=>'2',
                    'src'=>'3-3-400x400.jpg',
                ],
                [
                    'title_ru'=>'Натяжной потолок с фотопечатью',
                    'url'=>'1117',
                    'description_ru'=>'test',
                    'service_id'=>'2',
                    'src'=>'20141227_162956-400x400.jpg',
                ],
                [
                    'title_ru'=>'Аэрография на потолке',
                    'url'=>'aerografiya-na-potolke',
                    'description_ru'=>'test',
                    'service_id'=>'2',
                    'src'=>'maxresdefault-10-400x400.jpg',
                ],
                [
                    'title_ru'=>'Производство натяжных потолков',
                    'url'=>'proizvodstvo-natyazhnyh-potolkov',
                    'description_ru'=>'test',
                    'service_id'=>'2',
                    'src'=>'sl-1_1400_820-400x400.jpg',
                ],

                [
                    'title_ru'=>'Система отопления',
                    'url'=>'sistema-otopleniya',
                    'description_ru'=>'test',
                    'service_id'=>'3',
                    'src'=>'rasshiritelnyy-bak-dlya-otopleniya-zakrytogo-tipa-400x400.jpg',
                ],
                [
                    'title_ru'=>'Монтаж горячего и холодного водоснабжения',
                    'url'=>'montazh-goryachego-i-holodnogo-vodosnabzheniya',
                    'description_ru'=>'test',
                    'service_id'=>'3',
                    'src'=>'shema-400x400.jpg',
                ],
                [
                    'title_ru'=>'Сантехника для кухни',
                    'url'=>'santehnika-dlya-kuhni',
                    'description_ru'=>'test',
                    'service_id'=>'3',
                    'src'=>'afb9c8892ac57207a118f954de3e1afc-400x400.jpg',
                ],
                [
                    'title_ru'=>'Установка счетчиков',
                    'url'=>'ustanovka-schetchikov',
                    'description_ru'=>'test',
                    'service_id'=>'3',
                    'src'=>'vrezka_schetchikov-400x400.jpg',
                ],
                [
                    'title_ru'=>'Вызов сантехника',
                    'url'=>'vyzov-santehnika',
                    'description_ru'=>'test',
                    'service_id'=>'3',
                    'src'=>'92598754a0dff9b8cc6591c232872211-400x400.jpg',
                ],
                [
                    'title_ru'=>'Теплый водяной пол',
                    'url'=>'teplyj-vodyanoj-pol',
                    'description_ru'=>'test',
                    'service_id'=>'3',
                    'src'=>'shema-teplogo-vodjanogo-pola-400x400.jpg',
                ],

                [
                    'title_ru'=>'Услуги электрика',
                    'url'=>'uslugi-elektrika',
                    'description_ru'=>'test',
                    'service_id'=>'4',
                    'src'=>'Uslugi_elektrika8.jpg',
                ],
                [
                    'title_ru'=>'Электрический теплый пол',
                    'url'=>'elektricheskij-teplyj-pol',
                    'description_ru'=>'test',
                    'service_id'=>'4',
                    'src'=>'Elektricheskij_teplyj_pol14.jpg',
                ],

                [
                    'title_ru'=>'Изготовление корпусной мебели',
                    'url'=>'izgotovlenie-korpusnoj-mebeli',
                    'description_ru'=>'test',
                    'service_id'=>'5',
                    'src'=>'1494925628_izgotovlenie-korpusnoy-mebeli-400x360.jpg',
                ],
                [
                    'title_ru'=>'Кухни на заказ',
                    'url'=>'kuhni-na-zakaz',
                    'description_ru'=>'test',
                    'service_id'=>'5',
                    'src'=>'kuhni-andrej-179-400x400.jpg',
                ],
                [
                    'title_ru'=>'Шкаф-купе на заказ',
                    'url'=>'shkaf-kupe-na-zakaz',
                    'description_ru'=>'test',
                    'service_id'=>'5',
                    'src'=>'shkafy-kupe-tomsk-1-400x400.jpg',
                ],
                [
                    'title_ru'=>'Детская комната на заказ',
                    'url'=>'detskaya-komnata-na-zakaz',
                    'description_ru'=>'test',
                    'service_id'=>'5',
                    'src'=>'77-5-400x400.jpg',
                ],
                [
                    'title_ru'=>'Корпусная мебель для прихожей',
                    'url'=>'korpusnaya-mebel-dlya-prihozhej',
                    'description_ru'=>'test',
                    'service_id'=>'5',
                    'src'=>'2b39d04e50fde44f08d791ea61956f12-400x400.png',
                ],
                [
                    'title_ru'=>'Умная кухня для дома',
                    'url'=>'umnaya-kuhnya-dlya-doma',
                    'description_ru'=>'test',
                    'service_id'=>'5',
                    'src'=>'7c4a877a5e4ec397b8341f809965-400x400.jpg',
                ],

                [
                    'title_ru'=>'Дизайн помещений',
                    'url'=>'dizajn-pomeshhenij',
                    'description_ru'=>'test',
                    'service_id'=>'6',
                    'src'=>'Interika_3.jpg',
                ],
                [
                    'title_ru'=>'Дизайн-проект',
                    'url'=>'dizajn-proekt',
                    'description_ru'=>'test',
                    'service_id'=>'6',
                    'src'=>'Dizajn_proekt8-400x400.jpg',
                ],
                [
                    'title_ru'=>'Дизайн в стиле "Ампир"',
                    'url'=>'dizajn-v-stile-ampir',
                    'description_ru'=>'test',
                    'service_id'=>'6',
                    'src'=>'style-interior-ampir-5.jpg',
                ],
                [
                    'title_ru'=>'Английский стиль в интерьере',
                    'url'=>'anglijskij-stil-v-interere',
                    'description_ru'=>'test',
                    'service_id'=>'6',
                    'src'=>'anglijskij-stil-v-interere-foto-2.jpg',
                ],
                [
                    'title_ru'=>'Интерьер дома в стиле прованс',
                    'url'=>'interer-doma-v-stile-provans',
                    'description_ru'=>'test',
                    'service_id'=>'6',
                    'src'=>'styl_provence_v_iterere_02.jpg',
                ],
                [
                    'title_ru'=>'Стиль "хай-тек" в интерьере',
                    'url'=>'stil-haj-tek-v-interere',
                    'description_ru'=>'test',
                    'service_id'=>'6',
                    'src'=>'1_min-140.jpg',
                ],
                [
                    'title_ru'=>'Романский стиль в интерьере',
                    'url'=>'romanskij-stil-v-interere',
                    'description_ru'=>'test',
                    'service_id'=>'6',
                    'src'=>'stil-romanskiy1.jpg',
                ],
                [
                    'title_ru'=>'Рококко в интерьере',
                    'url'=>'rokokko-v-interere',
                    'description_ru'=>'test',
                    'service_id'=>'6',
                    'src'=>'kandelyabry-v-rokoko-min.jpg',
                ],
                [
                    'title_ru'=>'Стиль романизм в интерьере',
                    'url'=>'stil-romantizm-v-interere',
                    'description_ru'=>'test',
                    'service_id'=>'6',
                    'src'=>'romantizm-v-interere-foto.jpg',
                ],
                [
                    'title_ru'=>'Дизайн в стиле ренессанс',
                    'url'=>'dizajn-v-stile-renessans',
                    'description_ru'=>'test',
                    'service_id'=>'6',
                    'src'=>'vozrozhdenije_v_interjere-44.jpg',
                ],
                [
                    'title_ru'=>'Стиль в интерьере минимализм',
                    'url'=>'stil-v-interere-minimalizm',
                    'description_ru'=>'test',
                    'service_id'=>'6',
                    'src'=>'min.jpg',
                ],
                [
                    'title_ru'=>'Стиль конструктивизм',
                    'url'=>'stil-konstruktivizm',
                    'description_ru'=>'test',
                    'service_id'=>'6',
                    'src'=>'Stil-haitec.jpg',
                ],
                [
                    'title_ru'=>'Дизайн в стиле лофт',
                    'url'=>'dizajn-v-stile-loft',
                    'description_ru'=>'test',
                    'service_id'=>'6',
                    'src'=>'maxresdefault-1.jpg',
                ],
                [
                    'title_ru'=>'Классический стиль в интерьере',
                    'url'=>'klassicheskij-stil-v-interere',
                    'description_ru'=>'test',
                    'service_id'=>'6',
                    'src'=>'89fafa8b61157eeb5a6e0adce5475289.jpg',
                ],
                [
                    'title_ru'=>'Дизайн в стиле китч',
                    'url'=>'dizajn-v-stile-kitch',
                    'description_ru'=>'test',
                    'service_id'=>'6',
                    'src'=>'stil_kitch_v_interjere-36.jpg',
                ],
                [
                    'title_ru'=>'Стиль дизайна готика',
                    'url'=>'stil-dizajna-gotika',
                    'description_ru'=>'test',
                    'service_id'=>'6',
                    'src'=>'13-31.jpg',
                ],
                [
                    'title_ru'=>'Стиль в дизайне винтаж',
                    'url'=>'stil-v-dizajne-vintazh',
                    'description_ru'=>'test',
                    'service_id'=>'6',
                    'src'=>'vintazhnyy-stil-v-interyere-2.jpg',
                ],
                [
                    'title_ru'=>'Античный стиль дизайна',
                    'url'=>'antichnyj-stil-dizajna',
                    'description_ru'=>'test',
                    'service_id'=>'6',
                    'src'=>'64-1024x768.jpg',
                ],
                [
                    'title_ru'=>'Стиль ар-деко',
                    'url'=>'stil-ar-deko',
                    'description_ru'=>'test',
                    'service_id'=>'6',
                    'src'=>'Interer-art-deko-1024x819.jpg',
                ],
                [
                    'title_ru'=>'Стиль ар нуво',
                    'url'=>'stil-ar-nuvo',
                    'description_ru'=>'test',
                    'service_id'=>'6',
                    'src'=>'Interer-art-deko-1024x819.jpg',
                ],
                [
                    'title_ru'=>'Стиль барокко',
                    'url'=>'stil-barokko',
                    'description_ru'=>'test',
                    'service_id'=>'6',
                    'src'=>'barokko_v_interjere-33-400x400.jpg',
                ],
                [
                    'title_ru'=>'Кантри стиль',
                    'url'=>'kantri-stil',
                    'description_ru'=>'test',
                    'service_id'=>'6',
                    'src'=>'barokko_v_interjere-33-400x400.jpg',
                ],
                [
                    'title_ru'=>'Техно стиль в интерьере',
                    'url'=>'tehno-stil-v-interere',
                    'description_ru'=>'test',
                    'service_id'=>'6',
                    'src'=>'tehno-stil7.jpg',
                ],
                [
                    'title_ru'=>'Стиль фьюжн',
                    'url'=>'stil-fyuzhn',
                    'description_ru'=>'test',
                    'service_id'=>'6',
                    'src'=>'fyuzhn-stil121.jpg',
                ],
                [
                    'title_ru'=>'Электика стиль',
                    'url'=>'eklektika-stil',
                    'description_ru'=>'test',
                    'service_id'=>'6',
                    'src'=>'Eklektika_stil-400x400.jpg',
                ],
                [
                    'title_ru'=>'Этнический стиль в интерьере',
                    'url'=>'etnicheskij-stil-v-interere',
                    'description_ru'=>'test',
                    'service_id'=>'6',
                    'src'=>'Etnicheskij-stil-v-interere121.jpg',
                ],
                [
                    'title_ru'=>'Японский стиль интерьера',
                    'url'=>'yaponskij-stil-interera',
                    'description_ru'=>'test',
                    'service_id'=>'6',
                    'src'=>'aponskiiy-stil.jpg',
                ],
            ];
        foreach ($buffers as $buffer)
        {
            category::create($buffer);
        }
        $buffers=
            [
                [
                    'name'=>'whatsapp',
                    'link'=>'https://api.whatsapp.com/send/?phone=77751385080&text&type=phone_number&app_absent=0',
                ],
                [
                    'name'=>'telegram',
                    'link'=>'https://t.me/expertremonta01',
                ],
                [
                    'name'=>'instagram',
                    'link'=>'https://www.instagram.com/_remont_kvartir_pod_klyuch/',
                ],
                [
                    'name'=>'phone',
                    'link'=>'tel:+77751385080',
                ],
            ];
        foreach ($buffers as $buffer)
        {
            Contact::create($buffer);
        }
        $buffers=
            [
                [
                    'title_ru'=>'Эксперт ремонта',
                    'subtitle_ru'=>'Без предоплаты и с полной прозрачностью',
                    'src'=>'_9954dddd-1b73-4dcf-96de-7c340ccacc3a.jpg',
                ],
            ];
        foreach ($buffers as $buffer)
        {
            Header::create($buffer);
        }
        $buffers=
            [
                [
                    'title_ru'=>'Бесплатный выезд замерщика в день обращения',
                    'src'=>'4869724_54404-ai.png',
                ],
                [
                    'title_ru'=>'Строжайший контроль качества',
                    'src'=>'award_ribbon_check_mark_with_stars-ai.png',
                ],
                [
                    'title_ru'=>'Расчет сметы в течение дня',
                    'src'=>'1908.i211.002.p.m004.c20.stationery realistic set-02-ai (1).png',
                ],
                [
                    'title_ru'=>'Гарантия на выполненные работы',
                    'src'=>'7145.png',
                ],
                [
                    'title_ru'=>'Работаем без предоплаты',
                    'src'=>'shield_blue_gradient_with_check_and_without-ai.png',
                ],
                [
                    'title_ru'=>'Проверенные мастера',
                    'src'=>'someone-s-hand-holding-spanner.png',
                ],
            ];
        foreach ($buffers as $buffer)
        {
            WelcomeCard::create($buffer);
        }
        $buffers=
            [
                [
                    'title_ru'=>'Мы давно стали экспертами и Надежность — это самая важная составляющая нашей работы. Мы несём полную ответственность за эффективное выполнение своих обязанностей, по снабжению и технадзору объектов, по выполнению в срок и надлежащее качество всех проводимых работ, и по выполнению всех договорных и гарантийных обязательств.',
                    'src'=>'logo2.png',
                ]
            ];
        foreach ($buffers as $buffer)
        {
            About::create($buffer);
        }
        $buffers=
            [
                [
                    'title_ru'=>'Специализация',
                    'subtitle_ru'=>'Работаем с новостройками и вторичным жильем, придавая каждому объекту идеальный вид.',
                    'src'=>'image 1.png',
                ],
                [
                    'title_ru'=>'Постоянное совершенствование',
                    'subtitle_ru'=>'Регулярное улучшение технологий и методик работы гарантирует отменное качество',
                    'src'=>'image 2.png',
                ],
                [
                    'title_ru'=>'Контроль и гарантия',
                    'subtitle_ru'=>'Отслеживаем каждый этап выполнения работы и предоставляем гарантийное обслуживание в течение года.',
                    'src'=>'image 3.png',
                ],
                [
                    'title_ru'=>'Выгодные условия закупки',
                    'subtitle_ru'=>'Получите максимальные скидки на стройматериалы у наших партнеров.',
                    'src'=>'image 4.png',
                ],
                [
                    'title_ru'=>'Сервисное обслуживание',
                    'subtitle_ru'=>'Предлагаем комплексное и оперативное обслуживание для бизнеса: торговые точки, офисные центры, коттеджи и многое другое.',
                    'src'=>'image 5.png',
                ],
            ];
        foreach ($buffers as $buffer)
        {
            WhyCard::create($buffer);
        }
        $buffers=
            [
                [
                    'title_ru'=>'Скидка для своих -35% на мебель и ремонт',
                    'src'=>'_36f47cba-acd6-486f-b5e2-e73b036938cd.jpg',
                    'description_ru'=>'Приветствуем всех у кого *остро стоит вопрос ремонта квартиры и корпусной мебели в новую или старую или недавно купленную или вы живете в ней давно, да какая разница и вообще не суть , мы как компания гарантируем огромную выгоду, вы точно получите то что искали и максимальную скидку,  максимально выгодные и качественные услуги на корпусную и ремонт. Приходите считайте с менеджерами и рисуйте с дизайнерами и торгуйтесь!',
                    'period'=>'10',
                    'percent'=>'35',
                ],
                [
                    'title_ru'=>'Пожелавших переехать в Астану ждет теплый прием и большая скидка',
                    'src'=>'_50c7739d-b2ad-4a20-80c4-84d4b7a57e80.jpg',
                    'description_ru'=>'Тем, кто мечтает о собственном доме или квартире в Астане, стоит обратить внимание на то что компания Эксперт ремонта всегда рада помочь не только скидкой 10% и последующим ремонтом и выбором района и новостройки в городе, рассказав все преимущества и недостатки от территориальных до локальных и почерка застройщика. Переезжаем в город Нур Султан  – Вас ждет теплый прием и помощь компании во всем! Напомним что мы можем работать удаленно отчитываясь видео и фото отчетами о проделанной работе.',
                    'period'=>'10',
                    'percent'=>'5',
                ],
                [
                    'title_ru'=>'Выполнить ремонт без предоплаты',
                    'src'=>'_123d5c4c-40ed-4965-83dd-d6e3b2e07baf.jpg',
                    'description_ru'=>'Клиент всегда может заказать ремонт квартиры и потребовать от компании выполнить все необходимые работы без предоплаты в кассу, в данном случае компания  выполняет работы за свой счет и беспокоит клиента не чаще чем раз в неделю для подписания актов выполненных работ и накладных расходов компании. Подробнее в разделе сайта на главной странице частые вопросы в компанию',
                    'period'=>'10',
                    'percent'=>'5',
                ],
                [
                    'title_ru'=>'Ремонт квартиры под ключ - Натяжной потолок в подарок!',
                    'src'=>'_e216d94d-e427-4569-884b-88bce50841aa.jpg',
                    'description_ru'=>'При заказе ремонта квартиры под ключ компания предоставляет всем своим клиентам натяжной потолок производства Германии любого цвета и фактуры БЕСПЛАТНО во все ремонтируемые помещения, не имеет значения новостройка либо вторичное жилье все равно Бесплатно!',
                    'period'=>'10',
                    'percent'=>'5',
                ],
                [
                    'title_ru'=>'Пенсионерам и инвалидам 1-2 группы, военным в отставке Скидка от 10 до 20%',
                    'src'=>'_36f47cba-acd6-486f-b5e2-e73b036938cd.jpg',
                    'description_ru'=>'Пенсионерам и инвалидам 1-2 группы, и военным в отставке при наличии соответствующей выслуги лет компания дарит скидку от 10 до 20% при предоставлении соответствующего документа  в компанию',
                    'period'=>'10',
                    'percent'=>'5',
                ],
            ];
        foreach ($buffers as $buffer)
        {
            Sale::create($buffer);
        }
        $buffers=
            [
                [
                    'src'=>'maxresdefault.jpg',
                    'category_id'=>'1',
                ],
                [
                    'src'=>'o-465795239-facebook.jpg',
                    'category_id'=>'1',
                ],
                [
                    'src'=>'setwalls.ru-81752.jpg',
                    'category_id'=>'1',
                ],
                [
                    'src'=>'slider8.jpg',
                    'category_id'=>'1',
                ],
                [
                    'src'=>'Bez-nazvaniya.jpg',
                    'category_id'=>'1',
                ],
                [
                    'src'=>'iStock_000060926698_Medium.jpg',
                    'category_id'=>'1',
                ],

                [
                    'src'=>'kapitalnyj-remont-1.jpg',
                    'category_id'=>'2',
                ],
                [
                    'src'=>'remont-taunxausov-pod-klyuch-221.jpg',
                    'category_id'=>'2',
                ],
                [
                    'src'=>'remont-kvartir-pod-kluch.jpg',
                    'category_id'=>'2',
                ],
                [
                    'src'=>'IMG_9755.jpg',
                    'category_id'=>'2',
                ],
                [
                    'src'=>'637196a59bdb6fa39524a09b4ad28a8a.jpg',
                    'category_id'=>'2',
                ],
                [
                    'src'=>'19fc2d7e4e6e8feae6b1500ea97e1e4f3668d4b9.jpg',
                    'category_id'=>'2',
                ],
                [
                    'src'=>'4-4.jpg',
                    'category_id'=>'2',
                ],

                [
                    'src'=>'DSC9661.jpg',
                    'category_id'=>'3',
                ],
                [
                    'src'=>'1-8-1.jpg',
                    'category_id'=>'3',
                ],
                [
                    'src'=>'10-12-2063475.jpg',
                    'category_id'=>'3',
                ],
                [
                    'src'=>'d140696c445b0190c153eaa34acf1.jpg',
                    'category_id'=>'3',
                ],
                [
                    'src'=>'f5817886d0259bf5a39c2f4990339c81.jpg',
                    'category_id'=>'3',
                ],
                [
                    'src'=>'Kosmeticheskij-remont-kvartiry-svoimi-rukami.jpg',
                    'category_id'=>'3',
                ],
                [
                    'src'=>'remont-kvartir-pod-klyuch1.jpg',
                    'category_id'=>'3',
                ],

                [
                    'src'=>'35826d8bfbaa61ec92b0228743161b2c.jpg',
                    'category_id'=>'4',
                ],
                [
                    'src'=>'Kak-prinyat-kvartiru-v-novostrojke.jpg',
                    'category_id'=>'4',
                ],
                [
                    'src'=>'kapitalniy-11.jpg',
                    'category_id'=>'4',
                ],
                [
                    'src'=>'kapitalniy_remont.jpg',
                    'category_id'=>'4',
                ],
                [
                    'src'=>'kapitalnyy_remont_zdania_1.jpg',
                    'category_id'=>'4',
                ],
                [
                    'src'=>'maxresdefault-13.jpg',
                    'category_id'=>'4',
                ],
                [
                    'src'=>'remont_kvartir_pod_klyuch.jpg',
                    'category_id'=>'4',
                ],

                [
                    'src'=>'003.jpg',
                    'category_id'=>'5',
                ],
                [
                    'src'=>'8d317bdcf4aafcfc22149d77babee96d.jpg',
                    'category_id'=>'5',
                ],
                [
                    'src'=>'1340963062_remont-kvartir.jpg',
                    'category_id'=>'5',
                ],
                [
                    'src'=>'evro_rem_3.jpg',
                    'category_id'=>'5',
                ],
                [
                    'src'=>'evroremont-kvartir.jpg',
                    'category_id'=>'5',
                ],
                [
                    'src'=>'evroremont-kvartir-image-big-02.jpg',
                    'category_id'=>'5',
                ],
                [
                    'src'=>'evroremont-kvartir-v-moskve.3.jpg',
                    'category_id'=>'5',
                ],
                [
                    'src'=>'EVROREMONT-KVARTIR-V-MOSKVE.jpg',
                    'category_id'=>'5',
                ],

                [
                    'src'=>'1-9.jpg',
                    'category_id'=>'6',
                ],
                [
                    'src'=>'2_1.jpg',
                    'category_id'=>'6',
                ],
                [
                    'src'=>'4-3.jpg',
                    'category_id'=>'6',
                ],
                [
                    'src'=>'7273.jpg',
                    'category_id'=>'6',
                ],
                [
                    'src'=>'kompaniya-studiya-remontov_591b01672d493.jpg',
                    'category_id'=>'6',
                ],
                [
                    'src'=>'Kosmeticheskij-remont-2-h-komnatnoj-kvartiry.jpg',
                    'category_id'=>'6',
                ],
                [
                    'src'=>'kosrem.jpg',
                    'category_id'=>'6',
                ],
                [
                    'src'=>'yglyblennyi.jpg',
                    'category_id'=>'6',
                ],

                [
                    'src'=>'c7ec18763736fc57e0f84ac1e14ba9b1.jpg',
                    'category_id'=>'6',
                ],
                [
                    'src'=>'osiris-remont95.jpg',
                    'category_id'=>'7',
                ],
                [
                    'src'=>'pol-2.jpg',
                    'category_id'=>'7',
                ],
                [
                    'src'=>'remontpola_9.jpg',
                    'category_id'=>'7',
                ],
                [
                    'src'=>'remont-polov4.jpg',
                    'category_id'=>'7',
                ],
                [
                    'src'=>'remont-polov-21.jpg',
                    'category_id'=>'7',
                ],
                [
                    'src'=>'remont-polov-v-kvartire.jpg',
                    'category_id'=>'7',
                ],

                [
                    'src'=>'18.jpg',
                    'category_id'=>'8',
                ],
                [
                    'src'=>'423-otdelochnye-raboty.jpg',
                    'category_id'=>'8',
                ],
                [
                    'src'=>'52166.jpg',
                    'category_id'=>'8',
                ],
                [
                    'src'=>'Smeta-na-otdelochnye-raboty-2.jpg',
                    'category_id'=>'8',
                ],

                [
                    'src'=>'300x400x131.jpg.pagespeed.ic_.ox74nAd12R.jpg',
                    'category_id'=>'9',
                ],
                [
                    'src'=>'dbafc569753537a8b39aac409a04c2d7.jpg',
                    'category_id'=>'9',
                ],
                [
                    'src'=>'dc829de294dc3535224cf8ff09cf7586-zara-home-toilet.jpg',
                    'category_id'=>'9',
                ],
                [
                    'src'=>'dsc_0796.jpg',
                    'category_id'=>'9',
                ],
                [
                    'src'=>'kuhni-na-zakaz-1.jpg',
                    'category_id'=>'9',
                ],
                [
                    'src'=>'original_prof_img_7752.jpg',
                    'category_id'=>'9',
                ],
                [
                    'src'=>'remont-kvartir-nedorogo-ulyanovsk-8.jpg',
                    'category_id'=>'9',
                ],
                [
                    'src'=>'remont_vannoi_pvh_paneli-1024x768.jpg',
                    'category_id'=>'9',
                ],
                [
                    'src'=>'remont_vannoy_1-1-1024x768.jpg',
                    'category_id'=>'9',
                ],

                [
                    'src'=>'2-1-1.jpg',
                    'category_id'=>'10',
                ],
                [
                    'src'=>'2-4.jpg',
                    'category_id'=>'10',
                ],
                [
                    'src'=>'151569201057764285081ad7.02810539.jpg',
                    'category_id'=>'10',
                ],
                [
                    'src'=>'balkon_pod_klyuch_15.png',
                    'category_id'=>'10',
                ],
                [
                    'src'=>'maxresdefault-12.jpg',
                    'category_id'=>'10',
                ],
                [
                    'src'=>'otdelkabalkonovtomsk61.jpg',
                    'category_id'=>'10',
                ],
                [
                    'src'=>'uteplenie-balkonov-01.jpg',
                    'category_id'=>'10',
                ],
                [
                    'src'=>'Uteplenie-sten-i-pola-lodzhii.jpg',
                    'category_id'=>'10',
                ],

                [
                    'src'=>'2.24.jpg.jpg',
                    'category_id'=>'11',
                ],
                [
                    'src'=>'21.jpg',
                    'category_id'=>'11',
                ],
                [
                    'src'=>'28.jpg',
                    'category_id'=>'11',
                ],
                [
                    'src'=>'33-1.jpg',
                    'category_id'=>'11',
                ],
                [
                    'src'=>'9863999.jpg',
                    'category_id'=>'11',
                ],
                [
                    'src'=>'plitka2.jpg',
                    'category_id'=>'11',
                ],
                [
                    'src'=>'ukladka_kafela_v_novosibirske12_big.jpg',
                    'category_id'=>'11',
                ],
                [
                    'src'=>'ukladka-plitki-na-pol20.jpg',
                    'category_id'=>'11',
                ],

                [
                    'src'=>'3-1-1.jpg',
                    'category_id'=>'12',
                ],
                [
                    'src'=>'1316449051.jpg',
                    'category_id'=>'12',
                ],
                [
                    'src'=>'1317141792.jpg',
                    'category_id'=>'12',
                ],
                [
                    'src'=>'1441416052_potolok-iz-plastikovoy-vagonki.jpeg',
                    'category_id'=>'12',
                ],
                [
                    'src'=>'plastikovyj-potolok.jpg',
                    'category_id'=>'12',
                ],
                [
                    'src'=>'v-pomescheniyah-s-povyshennoy-vlazhnostyu-naprimer.jpg',
                    'category_id'=>'12',
                ],

                [
                    'src'=>'0.76888600-201372680951_-EA-F3-F5-ED-FF1-1.jpg',
                    'category_id'=>'13',
                ],
                [
                    'src'=>'43_743-1.jpg',
                    'category_id'=>'13',
                ],
                [
                    'src'=>'81bd7db29e461068f7223367fd819fc4-1.jpg',
                    'category_id'=>'13',
                ],
                [
                    'src'=>'kuhni-andrej-179-1.jpg',
                    'category_id'=>'13',
                ],
                [
                    'src'=>'kuhni-na-zakaz-28-1.jpg',
                    'category_id'=>'13',
                ],
                [
                    'src'=>'kuhni-na-zakaz-43-1.jpg',
                    'category_id'=>'13',
                ],
                [
                    'src'=>'Kuhni-na-zakaz-modern23-1170x950-1.jpg',
                    'category_id'=>'13',
                ],

                [
                    'src'=>'doors_5.jpg',
                    'category_id'=>'14',
                ],
                [
                    'src'=>'DSC_3503.jpg',
                    'category_id'=>'14',
                ],
                [
                    'src'=>'dveri.jpg',
                    'category_id'=>'14',
                ],
                [
                    'src'=>'img_20170113_191559.jpg',
                    'category_id'=>'14',
                ],
                [
                    'src'=>'IMG_20160718_113134.jpg',
                    'category_id'=>'14',
                ],
                [
                    'src'=>'ustanov_dver_foto_dlya_perelink54_2.jpg',
                    'category_id'=>'14',
                ],
                [
                    'src'=>'ustanovka-dverey-kupe-1-1024x1012.jpg',
                    'category_id'=>'14',
                ],

                [
                    'src'=>'14.jpg',
                    'category_id'=>'15',
                ],
                [
                    'src'=>'5915418f612aa2f7cff0d67528ac0d0180599292.jpeg',
                    'category_id'=>'15',
                ],
                [
                    'src'=>'Belyiy-satinovyiy-potolok-v-gostinoy.jpg',
                    'category_id'=>'15',
                ],
                [
                    'src'=>'dizajn-moskovskoj-kvartiry-foto-061.jpg',
                    'category_id'=>'15',
                ],
                [
                    'src'=>'mnogourovnevye-natyazhnye-potolki-3.jpg',
                    'category_id'=>'15',
                ],
                [
                    'src'=>'parjashchij-natjazhnoj-potolok-v-gostinnoj.jpg',
                    'category_id'=>'15',
                ],
                [
                    'src'=>'satin6.jpg',
                    'category_id'=>'15',
                ],

                [
                    'src'=>'8m-3chasa-1-1024x768.jpg',
                    'category_id'=>'16',
                ],
                [
                    'src'=>'esli_natyazhnoy_potolok_nado_demontirovat_2.jpg',
                    'category_id'=>'16',
                ],
                [
                    'src'=>'20150717_202048.jpg',
                    'category_id'=>'16',
                ],
                [
                    'src'=>'17m-3.5chasa-1024x768.jpg',
                    'category_id'=>'16',
                ],
                [
                    'src'=>'13m-3.5chasa-1-1024x768.jpg',
                    'category_id'=>'16',
                ],
                [
                    'src'=>'12m-4-chasa-2-1024x768.jpg',
                    'category_id'=>'16',
                ],
                [
                    'src'=>'12m-3chasa-3.jpg',
                    'category_id'=>'16',
                ],

                [
                    'src'=>'854048587.jpg',
                    'category_id'=>'17',
                ],
                [
                    'src'=>'descor6.jpg',
                    'category_id'=>'17',
                ],
                [
                    'src'=>'fleshka1-060.jpg',
                    'category_id'=>'17',
                ],
                [
                    'src'=>'img9586_1427365271.jpg',
                    'category_id'=>'17',
                ],
                [
                    'src'=>'IMG_20130208_144107.jpg',
                    'category_id'=>'17',
                ],
                [
                    'src'=>'Izobrazhenie-234.jpg',
                    'category_id'=>'17',
                ],
                [
                    'src'=>'mat-5.jpg',
                    'category_id'=>'17',
                ],

                [
                    'src'=>'0014.jpg',
                    'category_id'=>'18',
                ],
                [
                    'src'=>'b14a_qeadf35clyiic1xrjzssjunz.jpg',
                    'category_id'=>'18',
                ],
                [
                    'src'=>'e.jpg',
                    'category_id'=>'18',
                ],
                [
                    'src'=>'kakoy-natyazhnoy-potolok-luchshe-tkanevyy-ili-pvh.jpg',
                    'category_id'=>'18',
                ],

                [
                    'src'=>'111.jpg',
                    'category_id'=>'19',
                ],
                [
                    'src'=>'121.jpg',
                    'category_id'=>'19',
                ],
                [
                    'src'=>'1920x1080resize_portfolio13439_71_1370968435.jpg',
                    'category_id'=>'19',
                ],
                [
                    'src'=>'7657456.jpg',
                    'category_id'=>'19',
                ],
                [
                    'src'=>'vyf.jpg',
                    'category_id'=>'19',
                ],

                [
                    'src'=>'000003.jpg',
                    'category_id'=>'20',
                ],
                [
                    'src'=>'9.jpg',
                    'category_id'=>'20',
                ],
                [
                    'src'=>'530dc4d2b147d1.jpg',
                    'category_id'=>'20',
                ],
                [
                    'src'=>'429819.jpg',
                    'category_id'=>'20',
                ],
                [
                    'src'=>'maxresdefault-11.jpg',
                    'category_id'=>'20',
                ],
                [
                    'src'=>'Natyazhnye-potolki-zvyozdnoe-nebo-Skajlan-v-Orenburge-3.jpg',
                    'category_id'=>'20',
                ],
                [
                    'src'=>'zv_nebo1.jpg',
                    'category_id'=>'20',
                ],

                [
                    'src'=>'3-1.jpg',
                    'category_id'=>'21',
                ],
                [
                    'src'=>'615.jpg',
                    'category_id'=>'21',
                ],
                [
                    'src'=>'dUioZHc8DGk.jpg',
                    'category_id'=>'21',
                ],
                [
                    'src'=>'fot4.jpg',
                    'category_id'=>'21',
                ],
                [
                    'src'=>'Fotopechat-na-natyazhnykh-potolkakh-1.jpg',
                    'category_id'=>'21',
                ],
                [
                    'src'=>'fotopechat-potolok.jpg',
                    'category_id'=>'21',
                ],

                [
                    'src'=>'1yijgl.jpg',
                    'category_id'=>'22',
                ],
                [
                    'src'=>'d2cd10d-0.jpg',
                    'category_id'=>'22',
                ],
                [
                    'src'=>'img_4102.jpg',
                    'category_id'=>'22',
                ],
                [
                    'src'=>'Rospis-tkanevogo-natyazhnogo-potolka.jpg',
                    'category_id'=>'22',
                ],

                [
                    'src'=>'038.jpg',
                    'category_id'=>'23',
                ],
                [
                    'src'=>'1492708492131995640.jpg',
                    'category_id'=>'23',
                ],
                [
                    'src'=>'1492738403162358793.jpg',
                    'category_id'=>'23',
                ],
                [
                    'src'=>'biznes-na-proizvodstve-natyazhnyh-potolkov.png',
                    'category_id'=>'23',
                ],
                [
                    'src'=>'IMG_2984-kopiya.jpg',
                    'category_id'=>'23',
                ],
                [
                    'src'=>'interior-building-2.jpg',
                    'category_id'=>'23',
                ],
                [
                    'src'=>'proizvodstvo-natyazhnyx-potolkov-6.jpg',
                    'category_id'=>'23',
                ],
                [
                    'src'=>'proizvpotolki2.jpg',
                    'category_id'=>'23',
                ],

                [
                    'src'=>'Sistema-otopleniya1.jpg',
                    'category_id'=>'24',
                ],
                [
                    'src'=>'Sistema-otopleniya2.jpg',
                    'category_id'=>'24',
                ],
                [
                    'src'=>'Sistema-otopleniya3.jpg',
                    'category_id'=>'24',
                ],
                [
                    'src'=>'Sistema-otopleniya4.jpg',
                    'category_id'=>'24',
                ],
                [
                    'src'=>'Sistema-otopleniya5.jpg',
                    'category_id'=>'24',
                ],
                [
                    'src'=>'Sistema-otopleniya6.jpg',
                    'category_id'=>'24',
                ],
                [
                    'src'=>'Sistema-otopleniya8.jpg',
                    'category_id'=>'24',
                ],

                [
                    'src'=>'MONTAZH-GORYACHEGO-I-HOLODNOGO-VODOSNABZHENIYA1.jpg',
                    'category_id'=>'25',
                ],
                [
                    'src'=>'MONTAZH-GORYACHEGO-I-HOLODNOGO-VODOSNABZHENIYA2.jpg',
                    'category_id'=>'25',
                ],
                [
                    'src'=>'MONTAZH-GORYACHEGO-I-HOLODNOGO-VODOSNABZHENIYA3.jpg',
                    'category_id'=>'25',
                ],
                [
                    'src'=>'MONTAZH-GORYACHEGO-I-HOLODNOGO-VODOSNABZHENIYA4.jpg',
                    'category_id'=>'25',
                ],
                [
                    'src'=>'MONTAZH-GORYACHEGO-I-HOLODNOGO-VODOSNABZHENIYA9.jpg',
                    'category_id'=>'25',
                ],

                [
                    'src'=>'SANTEHNIKA-DLYA-KUHNI1.jpg',
                    'category_id'=>'26',
                ],
                [
                    'src'=>'SANTEHNIKA-DLYA-KUHNI2.jpg',
                    'category_id'=>'26',
                ],
                [
                    'src'=>'SANTEHNIKA-DLYA-KUHNI3.jpg',
                    'category_id'=>'26',
                ],
                [
                    'src'=>'SANTEHNIKA-DLYA-KUHNI6.jpg',
                    'category_id'=>'26',
                ],
                [
                    'src'=>'SANTEHNIKA-DLYA-KUHNI7.jpg',
                    'category_id'=>'26',
                ],
                [
                    'src'=>'SANTEHNIKA-DLYA-KUHNI8.jpg',
                    'category_id'=>'26',
                ],

                [
                    'src'=>'USTANOVKA-SCHETCHIKOV1.jpg',
                    'category_id'=>'27',
                ],
                [
                    'src'=>'USTANOVKA-SCHETCHIKOV2.jpg',
                    'category_id'=>'27',
                ],
                [
                    'src'=>'USTANOVKA-SCHETCHIKOV3.jpg',
                    'category_id'=>'27',
                ],
                [
                    'src'=>'USTANOVKA-SCHETCHIKOV8.jpg',
                    'category_id'=>'27',
                ],

                [
                    'src'=>'2df94c35bffd052adc8dd066323a1bc9.jpg',
                    'category_id'=>'28',
                ],

                [
                    'src'=>'Teplyj-vodyanoj-pol9.jpg',
                    'category_id'=>'29',
                ],
                [
                    'src'=>'Teplyj-vodyanoj-pol10.jpg',
                    'category_id'=>'29',
                ],
                [
                    'src'=>'Teplyj-vodyanoj-pol11.jpg',
                    'category_id'=>'29',
                ],
                [
                    'src'=>'Teplyj-vodyanoj-pol12.jpg',
                    'category_id'=>'29',
                ],
                [
                    'src'=>'Teplyj-vodyanoj-pol13.jpg',
                    'category_id'=>'29',
                ],
                [
                    'src'=>'Teplyj-vodyanoj-pol14.jpg',
                    'category_id'=>'29',
                ],
                [
                    'src'=>'Teplyj-vodyanoj-pol16.jpg',
                    'category_id'=>'29',
                ],

                [
                    'src'=>'Uslugi_elektrika1.jpg',
                    'category_id'=>'30',
                ],
                [
                    'src'=>'Uslugi_elektrika2.jpg',
                    'category_id'=>'30',
                ],
                [
                    'src'=>'Uslugi_elektrika4.jpg',
                    'category_id'=>'30',
                ],
                [
                    'src'=>'Uslugi_elektrika5.jpg',
                    'category_id'=>'30',
                ],
                [
                    'src'=>'Uslugi_elektrika6.jpg',
                    'category_id'=>'30',
                ],
                [
                    'src'=>'Uslugi_elektrika7.jpg',
                    'category_id'=>'30',
                ],

                [
                    'src'=>'Elektricheskij-teplyj-pol7.jpg',
                    'category_id'=>'31',
                ],
                [
                    'src'=>'Elektricheskij-teplyj-pol8.jpg',
                    'category_id'=>'31',
                ],
                [
                    'src'=>'Elektricheskij-teplyj-pol10.jpg',
                    'category_id'=>'31',
                ],
                [
                    'src'=>'Elektricheskij-teplyj-pol11.jpg',
                    'category_id'=>'31',
                ],
                [
                    'src'=>'Elektricheskij-teplyj-pol17.jpg',
                    'category_id'=>'31',
                ],
                [
                    'src'=>'Elektricheskij-teplyj-pol18.jpg',
                    'category_id'=>'31',
                ],
                [
                    'src'=>'Elektricheskij-teplyj-pol19.jpg',
                    'category_id'=>'31',
                ],

                [
                    'src'=>'2kyh-1.jpg',
                    'category_id'=>'32',
                ],
                [
                    'src'=>'656.jpeg',
                    'category_id'=>'32',
                ],
                [
                    'src'=>'1139.jpg',
                    'category_id'=>'32',
                ],
                [
                    'src'=>'000011572091-1.jpg',
                    'category_id'=>'32',
                ],
                [
                    'src'=>'610099841935-1.jpg',
                    'category_id'=>'32',
                ],
                [
                    'src'=>'d3b1dafecbda298eeb15d00e124eb849364217f7-1.png',
                    'category_id'=>'32',
                ],
                [
                    'src'=>'IMG_3305-1.png',
                    'category_id'=>'32',
                ],

                [
                    'src'=>'0.76888600-201372680951_-EA-F3-F5-ED-FF1.jpg',
                    'category_id'=>'33',
                ],
                [
                    'src'=>'kuhni-na-zakaz-28.jpg',
                    'category_id'=>'33',
                ],
                [
                    'src'=>'Kuhni-na-zakaz-modern23-1170x950.jpg',
                    'category_id'=>'33',
                ],
                [
                    'src'=>'kuxnya2.jpg',
                    'category_id'=>'33',
                ],

                [
                    'src'=>'1-2.jpg',
                    'category_id'=>'34',
                ],
                [
                    'src'=>'4d5845a6ba44db13f9473435fb6970ae.jpg',
                    'category_id'=>'34',
                ],
                [
                    'src'=>'33.jpg',
                    'category_id'=>'34',
                ],
                [
                    'src'=>'shkafi-0-01.jpg',
                    'category_id'=>'34',
                ],
                [
                    'src'=>'shkafyi-kupe-vstroennyie-na-zakaz.jpg',
                    'category_id'=>'34',
                ],

                [
                    'src'=>'4-22.jpg',
                    'category_id'=>'35',
                ],
                [
                    'src'=>'27-5.jpg',
                    'category_id'=>'35',
                ],
                [
                    'src'=>'detskaya-igrovaya-komnata.jpg',
                    'category_id'=>'35',
                ],
                [
                    'src'=>'detskaya-komnata-v-belom-tsvete-varianty-i-idei4.jpg',
                    'category_id'=>'35',
                ],
                [
                    'src'=>'detskaya-komnata-v-biryuzovykh-tonakh5.jpg',
                    'category_id'=>'35',
                ],
                [
                    'src'=>'svetodizajn_v_detskoj_komnate9993.jpg',
                    'category_id'=>'35',
                ],
                [
                    'src'=>'svetodizajn_v_detskoj_komnate9993-1.jpg',
                    'category_id'=>'35',
                ],

                [
                    'src'=>'3c0b71541e4f40dffd7a6f6cf6280fa1.png',
                    'category_id'=>'36',
                ],
                [
                    'src'=>'Korichnevaya-modulnaya-mebel-dlya-oformleniya-prihozhej-komnaty.png',
                    'category_id'=>'36',
                ],
                [
                    'src'=>'Variant-praktichnoj-idei-dizajna.jpeg',
                    'category_id'=>'36',
                ],

                [
                    'src'=>'7c4a877a5e4ec397b8341f809965.jpg',
                    'category_id'=>'37',
                ],
                [
                    'src'=>'febcf556db83deffda2318a6f89ede4a-1.jpg',
                    'category_id'=>'37',
                ],
                [
                    'src'=>'IMG_0756.jpg',
                    'category_id'=>'37',
                ],
                [
                    'src'=>'maxresdefault-20.jpg',
                    'category_id'=>'37',
                ],
                [
                    'src'=>'NE58K9850WS-AC-307714-0-1.jpg',
                    'category_id'=>'37',
                ],
                [
                    'src'=>'organizing-kitchen-storage_9-1.jpg',
                    'category_id'=>'37',
                ],
                [
                    'src'=>'organizing-kitchen-storage_18-1.jpg',
                    'category_id'=>'37',
                ],

                [
                    'src'=>'Dizajn_pomeshhenij1.jpg',
                    'category_id'=>'38',
                ],
                [
                    'src'=>'Dizajn_pomeshhenij2.jpg',
                    'category_id'=>'38',
                ],
                [
                    'src'=>'Dizajn_pomeshhenij3.jpg',
                    'category_id'=>'38',
                ],
                [
                    'src'=>'Dizajn_pomeshhenij5.jpg',
                    'category_id'=>'38',
                ],
                [
                    'src'=>'Dizajn_pomeshhenij6.jpg',
                    'category_id'=>'38',
                ],
                [
                    'src'=>'Dizajn_pomeshhenij7.jpg',
                    'category_id'=>'38',
                ],
                [
                    'src'=>'Dizajn_pomeshhenij8.jpg',
                    'category_id'=>'38',
                ],

                [
                    'src'=>'Dizajn_proekt1.jpg',
                    'category_id'=>'39',
                ],
                [
                    'src'=>'Dizajn_proekt3.jpg',
                    'category_id'=>'39',
                ],
                [
                    'src'=>'Dizajn_proekt5.jpg',
                    'category_id'=>'39',
                ],
                [
                    'src'=>'Dizajn_proekt6.jpg',
                    'category_id'=>'39',
                ],
                [
                    'src'=>'Dizajn_proekt9.jpg',
                    'category_id'=>'39',
                ],

                [
                    'src'=>'3fb507140c5b70d8600f508ac0b0.jpg',
                    'category_id'=>'40',
                ],
                [
                    'src'=>'10.jpg',
                    'category_id'=>'40',
                ],
                [
                    'src'=>'ampir5.jpg',
                    'category_id'=>'40',
                ],
                [
                    'src'=>'Bedroom_03.jpg',
                    'category_id'=>'40',
                ],
                [
                    'src'=>'Interer-spalni-v-stile-ampir.jpg',
                    'category_id'=>'40',
                ],
                [
                    'src'=>'interer-v-stile-ampir-2.jpg',
                    'category_id'=>'40',
                ],
                [
                    'src'=>'kuhnja-v-stile-ampir-10.jpg',
                    'category_id'=>'40',
                ],
                [
                    'src'=>'maxresdefault-5.jpg',
                    'category_id'=>'40',
                ],

                [
                    'src'=>'1.jpg',
                    'category_id'=>'41',
                ],
                [
                    'src'=>'1920x1080resize_interior42291_76_1410839540.jpg',
                    'category_id'=>'41',
                ],
                [
                    'src'=>'angliyskiy_stil_v_interere.jpg',
                    'category_id'=>'41',
                ],
                [
                    'src'=>'b-IMG_ad578dd92ea8.jpg',
                    'category_id'=>'41',
                ],
                [
                    'src'=>'english-style-in-interior-4.jpg',
                    'category_id'=>'41',
                ],

                [
                    'src'=>'82b48f99157bd1e4bae4bf2336d7f963.jpg',
                    'category_id'=>'42',
                ],
                [
                    'src'=>'1365589862.jpg',
                    'category_id'=>'42',
                ],
                [
                    'src'=>'bf0f6369478c21d22059e09336bd97c3.jpg',
                    'category_id'=>'42',
                ],
                [
                    'src'=>'dizajn-doma-v-stile-provans-v-podmoskove40.jpg',
                    'category_id'=>'42',
                ],
                [
                    'src'=>'dizajn-interera-v-stile-povans-2_0.jpg',
                    'category_id'=>'42',
                ],
                [
                    'src'=>'interer_doma_v_stile_provans_7.jpg',
                    'category_id'=>'42',
                ],
                [
                    'src'=>'krasivyj-dekor-spalni-v-stile-provans.jpg',
                    'category_id'=>'42',
                ],
                [
                    'src'=>'provans.jpg',
                    'category_id'=>'42',
                ],

                [
                    'src'=>'2-2.jpg',
                    'category_id'=>'43',
                ],
                [
                    'src'=>'2_min37.jpg',
                    'category_id'=>'43',
                ],
                [
                    'src'=>'3.jpg',
                    'category_id'=>'43',
                ],
                [
                    'src'=>'3-2.jpg',
                    'category_id'=>'43',
                ],
                [
                    'src'=>'interjer_high-tech-51.jpg',
                    'category_id'=>'43',
                ],
                [
                    'src'=>'maxresdefault-4.jpg',
                    'category_id'=>'43',
                ],
                [
                    'src'=>'shikarnyj-dekor-komnaty-v-stile-haj-tek.jpg',
                    'category_id'=>'43',
                ],
                [
                    'src'=>'stil-haj-tek-v-interere-foto-3.jpg',
                    'category_id'=>'43',
                ],

                [
                    'src'=>'24982776.jpg',
                    'category_id'=>'44',
                ],
                [
                    'src'=>'1484225192_.jpg',
                    'category_id'=>'44',
                ],
                [
                    'src'=>'12812690995784feaf42b094.50666570.jpg',
                    'category_id'=>'44',
                ],
                [
                    'src'=>'klassicgeskaja_gostinnaja-11.jpg',
                    'category_id'=>'44',
                ],
                [
                    'src'=>'rom-stil-v-interere.jpg',
                    'category_id'=>'44',
                ],

                [
                    'src'=>'340.jpg',
                    'category_id'=>'45',
                ],
                [
                    'src'=>'b-IMG_a78e3e908967.jpg',
                    'category_id'=>'45',
                ],
                [
                    'src'=>'Fascinating-Rococo-Living-Room-Design-with-Fetching-Chandelier-and-Green-Wall-Painting-also-Salmon-Curtain-and-Large-Red-Area-Rug.jpg',
                    'category_id'=>'45',
                ],
                [
                    'src'=>'gal4.jpg',
                    'category_id'=>'45',
                ],
                [
                    'src'=>'Rococo-Style-Living-room-with-Fireplace.jpg',
                    'category_id'=>'45',
                ],
                [
                    'src'=>'style-rococo-in-interior-1.jpg',
                    'category_id'=>'45',
                ],

                [
                    'src'=>'4-2.jpg',
                    'category_id'=>'46',
                ],
                [
                    'src'=>'article126_3.jpg',
                    'category_id'=>'46',
                ],
                [
                    'src'=>'houseadvice_35467890.jpg',
                    'category_id'=>'46',
                ],
                [
                    'src'=>'image-206320.jpg',
                    'category_id'=>'46',
                ],
                [
                    'src'=>'romantic_001.jpg',
                    'category_id'=>'46',
                ],
                [
                    'src'=>'ujutnaja-gostinaja-v-stile-romantizm.jpg',
                    'category_id'=>'46',
                ],
                [
                    'src'=>'z5425524fd44ba.jpg',
                    'category_id'=>'46',
                ],

                [
                    'src'=>'image.jpg',
                    'category_id'=>'47',
                ],
                [
                    'src'=>'interer_14-renessans_fresko.jpg',
                    'category_id'=>'47',
                ],
                [
                    'src'=>'Mebel-v-stile-Renessans.jpg',
                    'category_id'=>'47',
                ],
                [
                    'src'=>'Prostoy-no-uyutnyiy-stil-interera-renessans-v-gostinoy.jpg',
                    'category_id'=>'47',
                ],
                [
                    'src'=>'renessans.jpg',
                    'category_id'=>'47',
                ],
                [
                    'src'=>'Utonchennyiy-stil-renessans-oformlennyiy-v-spalne.jpg',
                    'category_id'=>'47',
                ],
                [
                    'src'=>'vozrozhdenije_v_interjere-1.gif',
                    'category_id'=>'47',
                ],
                [
                    'src'=>'vozrozhdenije_v_interjere-35.jpg',
                    'category_id'=>'47',
                ],

                [
                    'src'=>'2-1.jpg',
                    'category_id'=>'48',
                ],
                [
                    'src'=>'86-4.jpg',
                    'category_id'=>'48',
                ],
                [
                    'src'=>'625236ddf6f2d7c9a1b448747292762d2a.jpg',
                    'category_id'=>'48',
                ],
                [
                    'src'=>'Dizajn-interera-v-stile-minimalizm-10.jpg',
                    'category_id'=>'48',
                ],
                [
                    'src'=>'dizajn-sovremennykh-gostinykh-v-stile-minimalizm4.jpg',
                    'category_id'=>'48',
                ],
                [
                    'src'=>'maxresdefault-2.jpg',
                    'category_id'=>'48',
                ],
                [
                    'src'=>'Minimalizm-v-interjere-46.jpg',
                    'category_id'=>'48',
                ],

                [
                    'src'=>'920114a896229067055a55c8f3f2acc7b15a377e.jpg',
                    'category_id'=>'49',
                ],
                [
                    'src'=>'1422632721_konstruktivizm-1.jpg',
                    'category_id'=>'49',
                ],
                [
                    'src'=>'Interjer_construtivism-41.jpg',
                    'category_id'=>'49',
                ],
                [
                    'src'=>'konctruktivism-v-interere81.jpg',
                    'category_id'=>'49',
                ],
                [
                    'src'=>'konstruktivism00004.jpg',
                    'category_id'=>'49',
                ],
                [
                    'src'=>'Rabochij-kabinet-v-stile-konstruktivizma.jpg',
                    'category_id'=>'49',
                ],

                [
                    'src'=>'9g.jpg',
                    'category_id'=>'50',
                ],
                [
                    'src'=>'13.jpeg',
                    'category_id'=>'50',
                ],
                [
                    'src'=>'45dbeb21594611.563056ad5c494.jpg',
                    'category_id'=>'50',
                ],
                [
                    'src'=>'53-1.jpg',
                    'category_id'=>'50',
                ],
                [
                    'src'=>'dizajn-dvukhurovnevoj-kvartiry-v-stile-loft1.jpg',
                    'category_id'=>'50',
                ],

                [
                    'src'=>'876076.jpg',
                    'category_id'=>'51',
                ],
                [
                    'src'=>'classical-style-interior-design-3.jpg',
                    'category_id'=>'51',
                ],
                [
                    'src'=>'dizajn-gostinoj-v-klassicheskom-stile-9.jpg',
                    'category_id'=>'51',
                ],
                [
                    'src'=>'Foto-malenkoy-prihozhey-v-klassicheskom-stile.jpg',
                    'category_id'=>'51',
                ],
                [
                    'src'=>'Klasicheskaya-spalnya-01.jpg',
                    'category_id'=>'51',
                ],
                [
                    'src'=>'maxresdefault.jpg',
                    'category_id'=>'51',
                ],

                [
                    'src'=>'14-1.jpg',
                    'category_id'=>'52',
                ],
                [
                    'src'=>'34c24346e6dfdb912915be0f2d5699e9.jpg',
                    'category_id'=>'52',
                ],
                [
                    'src'=>'dizajn-interera-v-stile-kitch-2-1166x689.jpg',
                    'category_id'=>'52',
                ],
                [
                    'src'=>'dizajn-interera-v-stile-kitch-4-1166x689.jpg',
                    'category_id'=>'52',
                ],
                [
                    'src'=>'interier-v-stile-kitch-komnata3.jpg',
                    'category_id'=>'52',
                ],
                [
                    'src'=>'kitch1.jpg',
                    'category_id'=>'52',
                ],
                [
                    'src'=>'stil_kitch_v_interjere-34.jpg',
                    'category_id'=>'52',
                ],

                [
                    'src'=>'68237434.jpg',
                    'category_id'=>'53',
                ],
                [
                    'src'=>'101601142462.jpg',
                    'category_id'=>'53',
                ],
                [
                    'src'=>'1311989533323_w1920h1440.jpg',
                    'category_id'=>'53',
                ],
                [
                    'src'=>'gothic_001.jpg',
                    'category_id'=>'53',
                ],
                [
                    'src'=>'gotika3.jpg',
                    'category_id'=>'53',
                ],

                [
                    'src'=>'5-27.jpg',
                    'category_id'=>'54',
                ],
                [
                    'src'=>'elegant-rustic-bedroom.jpg',
                    'category_id'=>'54',
                ],
                [
                    'src'=>'Gostinnaya_stil_vintag_2.jpg',
                    'category_id'=>'54',
                ],
                [
                    'src'=>'img11l.jpg',
                    'category_id'=>'54',
                ],
                [
                    'src'=>'Stil-vintazh-v-interere-gostinoj-3.jpg',
                    'category_id'=>'54',
                ],
                [
                    'src'=>'Stil-vintazh-v-interere-spalni-14-1100x730.jpg',
                    'category_id'=>'54',
                ],
                [
                    'src'=>'Vintazhnyiy-stil-v-interere.jpg',
                    'category_id'=>'54',
                ],

                [
                    'src'=>'64-1024x768.jpg',
                    'category_id'=>'55',
                ],
                [
                    'src'=>'antichnij_stil_v_interjere-2.gif',
                    'category_id'=>'55',
                ],
                [
                    'src'=>'antycnxbxhdgfjryudcbnfjfhdgsdf1.jpg',
                    'category_id'=>'55',
                ],
                [
                    'src'=>'gostinaja-v-antichnom-stile.jpg',
                    'category_id'=>'55',
                ],
                [
                    'src'=>'living-room-in-antique-style.jpg',
                    'category_id'=>'55',
                ],

                [
                    'src'=>'0-1.jpg',
                    'category_id'=>'56',
                ],
                [
                    'src'=>'art-deko-v-interere-gostinoj12.jpg',
                    'category_id'=>'56',
                ],
                [
                    'src'=>'b-IMG_3eb159afdc3f.jpg',
                    'category_id'=>'56',
                ],
                [
                    'src'=>'gostinaya-v-art-deko.jpg',
                    'category_id'=>'56',
                ],
                [
                    'src'=>'kuxnya-v-stile-art-deko-1-26.jpg',
                    'category_id'=>'56',
                ],
                [
                    'src'=>'stil-art-deko-v-interere-1.jpg',
                    'category_id'=>'56',
                ],

                [
                    'src'=>'ar-nuvo2.jpg',
                    'category_id'=>'57',
                ],
                [
                    'src'=>'ar-nuvo3.jpg',
                    'category_id'=>'57',
                ],
                [
                    'src'=>'ar-nuvo4.jpg',
                    'category_id'=>'57',
                ],
                [
                    'src'=>'ar-nuvo5.jpg',
                    'category_id'=>'57',
                ],
                [
                    'src'=>'ar-nuvo9.jpg',
                    'category_id'=>'57',
                ],

                [
                    'src'=>'article-r79.jpg',
                    'category_id'=>'58',
                ],
                [
                    'src'=>'b61.jpg',
                    'category_id'=>'58',
                ],
                [
                    'src'=>'barocco13.jpg',
                    'category_id'=>'58',
                ],
                [
                    'src'=>'barokko-v-interere_597883da48640.jpg',
                    'category_id'=>'58',
                ],
                [
                    'src'=>'interer-gostinoj-v-stile-barokko36.jpg',
                    'category_id'=>'58',
                ],
                [
                    'src'=>'komnata-v-stile-barokko.jpg',
                    'category_id'=>'58',
                ],

                [
                    'src'=>'kantri-stil1.jpg',
                    'category_id'=>'59',
                ],
                [
                    'src'=>'kantri-stil2.jpg',
                    'category_id'=>'59',
                ],
                [
                    'src'=>'kantri-stil3.jpg',
                    'category_id'=>'59',
                ],
                [
                    'src'=>'kantri-stil4.jpg',
                    'category_id'=>'59',
                ],
                [
                    'src'=>'kantri-stil5.jpg',
                    'category_id'=>'59',
                ],
                [
                    'src'=>'kantri-stil7.jpg',
                    'category_id'=>'59',
                ],

                [
                    'src'=>'tehno-stil1.jpg',
                    'category_id'=>'60',
                ],
                [
                    'src'=>'tehno-stil1-1.jpg',
                    'category_id'=>'60',
                ],
                [
                    'src'=>'tehno-stil2.jpg',
                    'category_id'=>'60',
                ],
                [
                    'src'=>'tehno-stil2-1.jpg',
                    'category_id'=>'60',
                ],
                [
                    'src'=>'tehno-stil3.jpg',
                    'category_id'=>'60',
                ],
                [
                    'src'=>'tehno-stil4.jpg',
                    'category_id'=>'60',
                ],
                [
                    'src'=>'tehno-stil5.jpg',
                    'category_id'=>'60',
                ],
                [
                    'src'=>'tehno-stil6.jpg',
                    'category_id'=>'60',
                ],

                [
                    'src'=>'fyuzhn-stil2.jpg',
                    'category_id'=>'61',
                ],
                [
                    'src'=>'fyuzhn-stil3.jpg',
                    'category_id'=>'61',
                ],
                [
                    'src'=>'fyuzhn-stil4.jpg',
                    'category_id'=>'61',
                ],
                [
                    'src'=>'fyuzhn-stil5.jpg',
                    'category_id'=>'61',
                ],
                [
                    'src'=>'fyuzhn-stil6.jpg',
                    'category_id'=>'61',
                ],
                [
                    'src'=>'fyuzhn-stil7.jpg',
                    'category_id'=>'61',
                ],
                [
                    'src'=>'fyuzhn-stil8.jpg',
                    'category_id'=>'61',
                ],

                [
                    'src'=>'eklektika-stil122.jpg',
                    'category_id'=>'62',
                ],
                [
                    'src'=>'eklektika-stil123.jpg',
                    'category_id'=>'62',
                ],
                [
                    'src'=>'eklektika-stil124.jpg',
                    'category_id'=>'62',
                ],
                [
                    'src'=>'eklektika-stil126.jpg',
                    'category_id'=>'62',
                ],
                [
                    'src'=>'eklektika-stil127.jpg',
                    'category_id'=>'62',
                ],
                [
                    'src'=>'eklektika-stil128.jpg',
                    'category_id'=>'62',
                ],
                [
                    'src'=>'eklektika-stil129.jpg',
                    'category_id'=>'62',
                ],

                [
                    'src'=>'Etnicheskij-stil-v-interere1.jpg',
                    'category_id'=>'63',
                ],
                [
                    'src'=>'Etnicheskij-stil-v-interere2.jpg',
                    'category_id'=>'63',
                ],
                [
                    'src'=>'Etnicheskij-stil-v-interere3.jpg',
                    'category_id'=>'63',
                ],
                [
                    'src'=>'Etnicheskij-stil-v-interere4.jpg',
                    'category_id'=>'63',
                ],
                [
                    'src'=>'Etnicheskij-stil-v-interere5.jpg',
                    'category_id'=>'63',
                ],
                [
                    'src'=>'Etnicheskij-stil-v-interere6.jpg',
                    'category_id'=>'63',
                ],

                [
                    'src'=>'YAponskij-stil-interera1.jpg',
                    'category_id'=>'64',
                ],
                [
                    'src'=>'YAponskij-stil-interera2.jpg',
                    'category_id'=>'64',
                ],
                [
                    'src'=>'YAponskij-stil-interera3.jpg',
                    'category_id'=>'64',
                ],
                [
                    'src'=>'YAponskij-stil-interera5.jpg',
                    'category_id'=>'64',
                ],
                [
                    'src'=>'YAponskij-stil-interera6.jpg',
                    'category_id'=>'64',
                ],
                [
                    'src'=>'YAponskij-stil-interera7.jpg',
                    'category_id'=>'64',
                ],
            ];
        foreach ($buffers as $buffer)
        {
            CategoryImage::create($buffer);
        }
    }

    /**
     * Reverse the migrations.
     */
    public function down(): void
    {
        //
    }
};
